haskell/monoids.org
#+INCLUDE: ../theme/style.org
#+TITLE: Monoids and Foldables 

* Monoids and Foldables
** Monoids
*** Overview
    :PROPERTIES:
    :ID:       ef383b43-ab07-43a1-94b2-99b8425814c9
    :END:

A monoid is a type constructor with an _identity value_ _mempty_ and a
_binary operation_ _mappend_ that defines how two monoids can be
combinated to generate a new one. The function moncat concatenates a
list of monoids into a one monoid.

The monoid type class and monoid combinators are defined in the module
[[https://hackage.haskell.org/package/base-4.8.2.0/docs/Data-Monoid.html][Data.Monoid]].


#+BEGIN_SRC haskell
class Monoid m where

    {- Identity Element -}
    mempty :: m

    {- Associative / Binary operator - the alias
       for mappend is (<>) -}
    mappend :: m -> m -> m

    {- Fold a list using the monoid -}
    mconcat :: [m] -> m
    mconcat ms = foldr mappend mempty ms

#+END_SRC


| Function |    | Signature   | Description                        |
|----------+----+-------------+------------------------------------|
| mempty   | :: | m           | Identity element or Identity value |
| mappend  | :: | m -> m -> m | Binary operator                    |
| moncat   | :: | [m] -> m    | Concatenate list of monoids        |
| <>       | :: | m -> m ->   | Operator alias to mappend.         |



*Mappend*

Combine two monoids into a new one.

#+BEGIN_SRC haskell
mappend :: Monoid m => m -> m -> m
#+END_SRC

*Mappend Operator*

Alias for Mappend.

#+BEGIN_SRC haskell
(<>) :: Monoid a => a -> a -> a
(<>) = mappend
#+END_SRC

*Moncat*

Append a list of monoids into a new one.

#+BEGIN_SRC haskell
moncat :: Monoid m => [m] -> m
#+END_SRC

*Monoid Properties*


| Monoid Laws    |               |   |               |
|----------------+---------------+---+---------------|
| Associativity  | a <> (b <> c) | = | (a <> b) <> c |
| Left Identity  | mempty <> a   | = | a             |
| Right Identity | a <> mempty   | = | a             |


*Some Monoids*

| Monoid         | Operation | Identity |
|----------------+-----------+----------|
| Natural Number | +         | 0        |
| Integer > 0    | *         | 1        |
| Lists          | ++        | []       |
| Strings        | ++        | ""       |

*** Instances of Monoid Type Class
