haskell/monoids.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Monoids and Foldables</title>
<!-- 2018-05-07 Mon 10:11 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="nobody" />
<meta name="viewport" content="width=device-width, minimum-scale=1.0, maximum-scale=1.0" />
<link href="/Functional-Programming/theme/style.css" rel="stylesheet">
</head>
<body>
<div id="content">
<h1 class="title">Monoids and Foldables</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Monoids and Foldables</a>
<ul>
<li><a href="#sec-1-1">1.1. Monoids</a>
<ul>
<li><a href="#sec-1-1-1">1.1.1. Overview</a></li>
<li><a href="#sec-1-1-2">1.1.2. Instances of Monoid Type Class</a>
<ul>
<li><a href="#sec-1-1-2-1">1.1.2.1. List</a></li>
<li><a href="#sec-1-1-2-2">1.1.2.2. String</a></li>
<li><a href="#sec-1-1-2-3">1.1.2.3. Sum</a></li>
<li><a href="#sec-1-1-2-4">1.1.2.4. Product</a></li>
<li><a href="#sec-1-1-2-5">1.1.2.5. Maybe</a></li>
<li><a href="#sec-1-1-2-6">1.1.2.6. First</a></li>
<li><a href="#sec-1-1-2-7">1.1.2.7. Last</a></li>
<li><a href="#sec-1-1-2-8">1.1.2.8. Endo</a></li>
</ul>
</li>
<li><a href="#sec-1-1-3">1.1.3. References</a></li>
</ul>
</li>
<li><a href="#sec-1-2">1.2. Foldable</a>
<ul>
<li><a href="#sec-1-2-1">1.2.1. Overview</a></li>
<li><a href="#sec-1-2-2">1.2.2. Instance of class foldable</a>
<ul>
<li><a href="#sec-1-2-2-1">1.2.2.1. Get all Foldable instances</a></li>
<li><a href="#sec-1-2-2-2">1.2.2.2. List</a></li>
<li><a href="#sec-1-2-2-3">1.2.2.3. Maybe</a></li>
</ul>
</li>
<li><a href="#sec-1-2-3">1.2.3. References</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<lu> 
  <li><a href="/Functional-Programming/index.html">Index</a></li>
  <li><a href="https://github.com/caiorss/Functional-Programming">Repository</a></li>
</lu>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Monoids and Foldables</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Monoids</h3>
<div class="outline-text-3" id="text-1-1">
</div><div id="outline-container-sec-1-1-1" class="outline-4">
<h4 id="sec-1-1-1"><a id="ID-ef383b43-ab07-43a1-94b2-99b8425814c9" name="ID-ef383b43-ab07-43a1-94b2-99b8425814c9"></a><span class="section-number-4">1.1.1</span> Overview</h4>
<div class="outline-text-4" id="text-1-1-1">

<p>
A monoid is a type constructor with an <span class="underline">identity value</span> <span class="underline">mempty</span> and a
<span class="underline">binary operation</span> <span class="underline">mappend</span> that defines how two monoids can be
combinated to generate a new one. The function moncat concatenates a
list of monoids into a one monoid.
</p>

<p>
The monoid type class and monoid combinators are defined in the module
<a href="https://hackage.haskell.org/package/base-4.8.2.0/docs/Data-Monoid.html">Data.Monoid</a>.
</p>


<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-keyword">class</span> <span class="org-haskell-type">Monoid</span> m <span class="org-haskell-keyword">where</span>

    <span class="org-comment-delimiter">{- </span><span class="org-comment">Identity Element -}</span>
    mempty <span class="org-haskell-operator">::</span> m

    <span class="org-comment-delimiter">{- </span><span class="org-comment">Associative / Binary operator - the alias</span>
<span class="org-comment">       for mappend is (&lt;&gt;) -}</span>
    mappend <span class="org-haskell-operator">::</span> m <span class="org-haskell-operator">-&gt;</span> m <span class="org-haskell-operator">-&gt;</span> m

    <span class="org-comment-delimiter">{- </span><span class="org-comment">Fold a list using the monoid -}</span>
    mconcat <span class="org-haskell-operator">::</span> [m] <span class="org-haskell-operator">-&gt;</span> m
    mconcat ms <span class="org-haskell-operator">=</span> foldr mappend mempty ms
</pre>
</div>


<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">Function</th>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">Signature</th>
<th scope="col" class="left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">mempty</td>
<td class="left">::</td>
<td class="left">m</td>
<td class="left">Identity element or Identity value</td>
</tr>

<tr>
<td class="left">mappend</td>
<td class="left">::</td>
<td class="left">m -&gt; m -&gt; m</td>
<td class="left">Binary operator</td>
</tr>

<tr>
<td class="left">moncat</td>
<td class="left">::</td>
<td class="left">[m] -&gt; m</td>
<td class="left">Concatenate list of monoids</td>
</tr>

<tr>
<td class="left">&lt;&gt;</td>
<td class="left">::</td>
<td class="left">m -&gt; m -&gt;</td>
<td class="left">Operator alias to mappend.</td>
</tr>
</tbody>
</table>



<p>
<b>Mappend</b>
</p>

<p>
Combine two monoids into a new one.
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-function-name">mappend</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Monoid</span> m <span class="org-haskell-operator">=&gt;</span> m <span class="org-haskell-operator">-&gt;</span> m <span class="org-haskell-operator">-&gt;</span> m
</pre>
</div>

<p>
<b>Mappend Operator</b>
</p>

<p>
Alias for Mappend.
</p>

<div class="org-src-container">

<pre class="src src-haskell">(<span class="org-haskell-definition">&lt;&gt;</span>) <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Monoid</span> a <span class="org-haskell-operator">=&gt;</span> a <span class="org-haskell-operator">-&gt;</span> a <span class="org-haskell-operator">-&gt;</span> a
(<span class="org-haskell-definition">&lt;&gt;</span>) <span class="org-haskell-operator">=</span> mappend
</pre>
</div>

<p>
<b>Moncat</b>
</p>

<p>
Append a list of monoids into a new one.
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-function-name">moncat</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Monoid</span> m <span class="org-haskell-operator">=&gt;</span> [m] <span class="org-haskell-operator">-&gt;</span> m
</pre>
</div>

<p>
<b>Monoid Properties</b>
</p>


<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">Monoid Laws</th>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">Associativity</td>
<td class="left">a &lt;&gt; (b &lt;&gt; c)</td>
<td class="left">=</td>
<td class="left">(a &lt;&gt; b) &lt;&gt; c</td>
</tr>

<tr>
<td class="left">Left Identity</td>
<td class="left">mempty &lt;&gt; a</td>
<td class="left">=</td>
<td class="left">a</td>
</tr>

<tr>
<td class="left">Right Identity</td>
<td class="left">a &lt;&gt; mempty</td>
<td class="left">=</td>
<td class="left">a</td>
</tr>
</tbody>
</table>


<p>
<b>Some Monoids</b>
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">Monoid</th>
<th scope="col" class="left">Operation</th>
<th scope="col" class="left">Identity</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">Natural Number</td>
<td class="left">+</td>
<td class="left">0</td>
</tr>

<tr>
<td class="left">Integer &gt; 0</td>
<td class="left">*</td>
<td class="left">1</td>
</tr>

<tr>
<td class="left">Lists</td>
<td class="left">++</td>
<td class="left">[]</td>
</tr>

<tr>
<td class="left">Strings</td>
<td class="left">++</td>
<td class="left">""</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-sec-1-1-2" class="outline-4">
<h4 id="sec-1-1-2"><span class="section-number-4">1.1.2</span> Instances of Monoid Type Class</h4>
