haskell/monoids.org
**** List


| Function        |    | Signature         | Description                     |
|-----------------+----+-------------------+---------------------------------|
| Monoid instance |    | [a]               |                                 |
|                 |    |                   |                                 |
| mempty          | :: | []                | Identity element is empty list. |
| mappend         | :: | [a] -> [a] -> [a] | Concatenate two lists           |
| moncat          | :: | [a] -> a          | Concatenate a list of lists     |
| <>              | :: | [a] -> [a] -> [a] | Alias to mappend.               |
|                 |    |                   |                                 |


#+BEGIN_SRC haskell
instance Monoid [a] where
    mempty  = []
    mappend = (++)

    -- mconcat :: [m] -> m
    -- mconcat ms = foldr mappend mempty ms
    mconcat = concat
#+END_SRC

Example:

#+BEGIN_SRC haskell

----------------------
-- Test List Monoids

>>> import Data.Monoid
>>>
>>> :t mconcat
mconcat :: Monoid a => [a] -> a
>>>
>>> :t mempty
mempty :: Monoid a => a
>>>
>>> :t mappend
mappend :: Monoid a => a -> a -> a
>>>
>>> :t (<>)
(<>) :: Monoid m => m -> m -> m
>>>

>>> [9, 3] <> [1, 2, 3]
[9,3,1,2,3]
>>>

>>> mempty :: [a]
[]
>>>

>>> [1, 2, 3] <> mempty
[1,2,3]

>>> mempty <> [1, 2, 3]
[1,2,3]
>>>

>>> [9, 3] <> [1, 2, 3] <> [9, 3, 10]
[9,3,1,2,3,9,3,10]
>>>

>>> [9, 3] `mappend` [1, 2, 3] `mappend` [9, 3, 10]
[9,3,1,2,3,9,3,10]
>>>

#+END_SRC

**** String

Strings are similar to lists and the mempty element is a empty string.

| Function        |    | Signature                  | Description                   |
|-----------------+----+----------------------------+-------------------------------|
| Monoid instance |    | String                     |                               |
|                 |    |                            |                               |
| mempty          | :: | ""                         | Empty string                  |
| mappend         | :: | String -> String -> String | Concatenate two strings       |
| moncat          | :: | [String] -> String         | Concatenate a list of strings |
| <>              | :: | String -> String -> String | Same as mappend.              |
|                 |    |                            |                               |


#+BEGIN_SRC haskell
>>> import Data.Monoid

>>> :t mempty
mempty :: Monoid a => a
>>>

>>> mempty :: String
""
>>>

>>> :t mappend
mappend :: Monoid a => a -> a -> a
>>>

>>> "Testing " `mappend` " String " `mappend` " monoids"
"Testing  String  monoids"
>>>

>>> "Testing " <> " String " <> " monoids"
"Testing  String  monoids"
>>>

>>> :t mconcat
mconcat :: Monoid a => [a] -> a
>>>


>>> mconcat ["Testing ", "String", " monoids"]
"Testing String monoids"
>>>
#+END_SRC

