haskell/monoids.html
<div class="outline-text-4" id="text-1-1-2">
</div><div id="outline-container-sec-1-1-2-1" class="outline-5">
<h5 id="sec-1-1-2-1"><span class="section-number-5">1.1.2.1</span> List</h5>
<div class="outline-text-5" id="text-1-1-2-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">Function</th>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">Signature</th>
<th scope="col" class="left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">Monoid instance</td>
<td class="left">&#xa0;</td>
<td class="left">[a]</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">mempty</td>
<td class="left">::</td>
<td class="left">[]</td>
<td class="left">Identity element is empty list.</td>
</tr>

<tr>
<td class="left">mappend</td>
<td class="left">::</td>
<td class="left">[a] -&gt; [a] -&gt; [a]</td>
<td class="left">Concatenate two lists</td>
</tr>

<tr>
<td class="left">moncat</td>
<td class="left">::</td>
<td class="left">[a] -&gt; a</td>
<td class="left">Concatenate a list of lists</td>
</tr>

<tr>
<td class="left">&lt;&gt;</td>
<td class="left">::</td>
<td class="left">[a] -&gt; [a] -&gt; [a]</td>
<td class="left">Alias to mappend.</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
</table>


<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-keyword">instance</span> <span class="org-haskell-type">Monoid</span> [a] <span class="org-haskell-keyword">where</span>
    mempty  <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">[]</span>
    mappend <span class="org-haskell-operator">=</span> (<span class="org-haskell-operator">++</span>)

    <span class="org-comment-delimiter">-- </span><span class="org-comment">mconcat :: [m] -&gt; m</span>
    <span class="org-comment-delimiter">-- </span><span class="org-comment">mconcat ms = foldr mappend mempty ms</span>
    mconcat <span class="org-haskell-operator">=</span> concat
</pre>
</div>

<p>
Example:
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-comment-delimiter">--</span><span class="org-comment">--------------------</span>
<span class="org-comment-delimiter">-- </span><span class="org-comment">Test List Monoids</span>

<span class="org-haskell-operator">&gt;&gt;&gt;</span> <span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">Data.Monoid</span>
<span class="org-haskell-operator">&gt;&gt;&gt;</span>
<span class="org-haskell-operator">&gt;&gt;&gt;</span> <span class="org-haskell-constructor">:</span>t mconcat
<span class="org-function-name">mconcat</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Monoid</span> a <span class="org-haskell-operator">=&gt;</span> [a] <span class="org-haskell-operator">-&gt;</span> a
<span class="org-haskell-operator">&gt;&gt;&gt;</span>
<span class="org-haskell-operator">&gt;&gt;&gt;</span> <span class="org-haskell-type">:</span>t mempty
<span class="org-function-name">mempty</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Monoid</span> a <span class="org-haskell-operator">=&gt;</span> a
<span class="org-haskell-operator">&gt;&gt;&gt;</span>
<span class="org-haskell-operator">&gt;&gt;&gt;</span> <span class="org-haskell-type">:</span>t mappend
<span class="org-function-name">mappend</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Monoid</span> a <span class="org-haskell-operator">=&gt;</span> a <span class="org-haskell-operator">-&gt;</span> a <span class="org-haskell-operator">-&gt;</span> a
<span class="org-haskell-operator">&gt;&gt;&gt;</span>
<span class="org-haskell-operator">&gt;&gt;&gt;</span> <span class="org-haskell-type">:</span>t (<span class="org-haskell-operator">&lt;&gt;</span>)
(<span class="org-haskell-definition">&lt;&gt;</span>) <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Monoid</span> m <span class="org-haskell-operator">=&gt;</span> m <span class="org-haskell-operator">-&gt;</span> m <span class="org-haskell-operator">-&gt;</span> m
<span class="org-haskell-operator">&gt;&gt;&gt;</span>

<span class="org-haskell-operator">&gt;&gt;&gt;</span> [9, 3] <span class="org-haskell-operator">&lt;&gt;</span> [1, 2, 3]
[9,3,1,2,3]
<span class="org-haskell-operator">&gt;&gt;&gt;</span>

<span class="org-haskell-operator">&gt;&gt;&gt;</span> mempty <span class="org-haskell-operator">::</span> [a]
<span class="org-haskell-constructor">[]</span>
<span class="org-haskell-operator">&gt;&gt;&gt;</span>

<span class="org-haskell-operator">&gt;&gt;&gt;</span> [1, 2, 3] <span class="org-haskell-operator">&lt;&gt;</span> mempty
[1,2,3]

<span class="org-haskell-operator">&gt;&gt;&gt;</span> mempty <span class="org-haskell-operator">&lt;&gt;</span> [1, 2, 3]
[1,2,3]
<span class="org-haskell-operator">&gt;&gt;&gt;</span>

<span class="org-haskell-operator">&gt;&gt;&gt;</span> [9, 3] <span class="org-haskell-operator">&lt;&gt;</span> [1, 2, 3] <span class="org-haskell-operator">&lt;&gt;</span> [9, 3, 10]
[9,3,1,2,3,9,3,10]
<span class="org-haskell-operator">&gt;&gt;&gt;</span>

<span class="org-haskell-operator">&gt;&gt;&gt;</span> [9, 3] <span class="org-haskell-operator">`mappend`</span> [1, 2, 3] <span class="org-haskell-operator">`mappend`</span> [9, 3, 10]
[9,3,1,2,3,9,3,10]
<span class="org-haskell-operator">&gt;&gt;&gt;</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-1-2-2" class="outline-5">
<h5 id="sec-1-1-2-2"><span class="section-number-5">1.1.2.2</span> String</h5>
<div class="outline-text-5" id="text-1-1-2-2">
<p>
Strings are similar to lists and the mempty element is a empty string.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">Function</th>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">Signature</th>
<th scope="col" class="left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">Monoid instance</td>
<td class="left">&#xa0;</td>
<td class="left">String</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">mempty</td>
<td class="left">::</td>
<td class="left">""</td>
<td class="left">Empty string</td>
</tr>

<tr>
<td class="left">mappend</td>
<td class="left">::</td>
<td class="left">String -&gt; String -&gt; String</td>
<td class="left">Concatenate two strings</td>
</tr>

<tr>
<td class="left">moncat</td>
<td class="left">::</td>
<td class="left">[String] -&gt; String</td>
<td class="left">Concatenate a list of strings</td>
</tr>

<tr>
<td class="left">&lt;&gt;</td>
<td class="left">::</td>
<td class="left">String -&gt; String -&gt; String</td>
<td class="left">Same as mappend.</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
</table>


<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-operator">&gt;&gt;&gt;</span> <span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">Data.Monoid</span>

<span class="org-haskell-operator">&gt;&gt;&gt;</span> <span class="org-haskell-constructor">:</span>t mempty
<span class="org-function-name">mempty</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Monoid</span> a <span class="org-haskell-operator">=&gt;</span> a
<span class="org-haskell-operator">&gt;&gt;&gt;</span>

<span class="org-haskell-operator">&gt;&gt;&gt;</span> mempty <span class="org-haskell-operator">::</span> <span class="org-haskell-type">String</span>
<span class="org-string">""</span>
<span class="org-haskell-operator">&gt;&gt;&gt;</span>

<span class="org-haskell-operator">&gt;&gt;&gt;</span> <span class="org-haskell-constructor">:</span>t mappend
<span class="org-function-name">mappend</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Monoid</span> a <span class="org-haskell-operator">=&gt;</span> a <span class="org-haskell-operator">-&gt;</span> a <span class="org-haskell-operator">-&gt;</span> a
<span class="org-haskell-operator">&gt;&gt;&gt;</span>

<span class="org-haskell-operator">&gt;&gt;&gt;</span> <span class="org-string">"Testing "</span> <span class="org-haskell-operator">`mappend`</span> <span class="org-string">" String "</span> <span class="org-haskell-operator">`mappend`</span> <span class="org-string">" monoids"</span>
<span class="org-string">"Testing  String  monoids"</span>
<span class="org-haskell-operator">&gt;&gt;&gt;</span>

<span class="org-haskell-operator">&gt;&gt;&gt;</span> <span class="org-string">"Testing "</span> <span class="org-haskell-operator">&lt;&gt;</span> <span class="org-string">" String "</span> <span class="org-haskell-operator">&lt;&gt;</span> <span class="org-string">" monoids"</span>
<span class="org-string">"Testing  String  monoids"</span>
<span class="org-haskell-operator">&gt;&gt;&gt;</span>

<span class="org-haskell-operator">&gt;&gt;&gt;</span> <span class="org-haskell-constructor">:</span>t mconcat
<span class="org-function-name">mconcat</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Monoid</span> a <span class="org-haskell-operator">=&gt;</span> [a] <span class="org-haskell-operator">-&gt;</span> a
<span class="org-haskell-operator">&gt;&gt;&gt;</span>


<span class="org-haskell-operator">&gt;&gt;&gt;</span> mconcat [<span class="org-string">"Testing "</span>, <span class="org-string">"String"</span>, <span class="org-string">" monoids"</span>]
<span class="org-string">"Testing String monoids"</span>
<span class="org-haskell-operator">&gt;&gt;&gt;</span>
</pre>
</div>
</div>
</div>
