haskell/monoids.org
**** Sum

| Function        |    | Signature                           | Description                 |
|-----------------+----+-------------------------------------+-----------------------------|
| Monoid instance |    | newtype Sum a = Sum { getSum :: a } |                             |
|                 |    |                                     |                             |
| mempty          | :: | Sum 0                               | Identity element            |
| mappend         | :: | Sum a -> Sum a -> Sum a             | Binary operation is sum (+) |
| moncat          | :: | [Sum a] -> Sum a                    | Sum all numbers of a list   |
| <>              | :: | Sum a -> Sum a -> Sum a             | Alias to mappend.           |
|                 |    |                                     |                             |


#+BEGIN_SRC haskell
-- | Monoid under addition.
newtype Sum a = Sum { getSum :: a }
        deriving (Eq, Ord, Read, Show, Bounded, Generic, Generic1, Num)

instance Num a => Monoid (Sum a) where
        mempty = Sum 0
        mappend = coerce ((+) :: a -> a -> a)
--        Sum x `mappend` Sum y = Sum (x + y)
#+END_SRC

Example:

#+BEGIN_SRC haskell

>>> import Data.Monoid


{- Sum Monoid
 ----------------------------------}
> :t Sum 
Sum :: a -> Sum a
> Sum 10 
Sum {getSum = 10}
> 

> :t getSum 
getSum :: Sum a -> a
> 

>>> mempty :: Sum Int
Sum {getSum = 0}

>>> mempty :: Product Int
Product {getProduct = 1}
>>>

>>> getSum (mempty :: Sum Int)
0

>>> 1 <> mempty <> 2 <> 3 <> 10 :: Sum Int
Sum {getSum = 16}
>>>

>>> 1 `mappend` mempty `mappend` 2 `mappend` 3 `mappend` 10 :: Sum Int
Sum {getSum = 16}
>>>

>>> mconcat [1, mempty, 2, 3, 10] :: Sum Int
Sum {getSum = 16}
>>>

>>> getSum ( mconcat [1, mempty, 2, 3, 10] :: Sum Int)
16
>>>

#+END_SRC

