haskell/monoids.html

<div id="outline-container-sec-1-1-2-3" class="outline-5">
<h5 id="sec-1-1-2-3"><span class="section-number-5">1.1.2.3</span> Sum</h5>
<div class="outline-text-5" id="text-1-1-2-3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">Function</th>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">Signature</th>
<th scope="col" class="left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">Monoid instance</td>
<td class="left">&#xa0;</td>
<td class="left">newtype Sum a = Sum { getSum :: a }</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">mempty</td>
<td class="left">::</td>
<td class="left">Sum 0</td>
<td class="left">Identity element</td>
</tr>

<tr>
<td class="left">mappend</td>
<td class="left">::</td>
<td class="left">Sum a -&gt; Sum a -&gt; Sum a</td>
<td class="left">Binary operation is sum (+)</td>
</tr>

<tr>
<td class="left">moncat</td>
<td class="left">::</td>
<td class="left">[Sum a] -&gt; Sum a</td>
<td class="left">Sum all numbers of a list</td>
</tr>

<tr>
<td class="left">&lt;&gt;</td>
<td class="left">::</td>
<td class="left">Sum a -&gt; Sum a -&gt; Sum a</td>
<td class="left">Alias to mappend.</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
</table>


<div class="org-src-container">

<pre class="src src-haskell"><span class="org-doc">-- | Monoid under addition.</span>
<span class="org-haskell-keyword">newtype</span> <span class="org-haskell-type">Sum</span> a <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Sum</span> { getSum <span class="org-haskell-operator">::</span> a }
        <span class="org-haskell-keyword">deriving</span> (<span class="org-haskell-constructor">Eq</span>, <span class="org-haskell-constructor">Ord</span>, <span class="org-haskell-constructor">Read</span>, <span class="org-haskell-constructor">Show</span>, <span class="org-haskell-constructor">Bounded</span>, <span class="org-haskell-constructor">Generic</span>, <span class="org-haskell-constructor">Generic1</span>, <span class="org-haskell-constructor">Num</span>)

<span class="org-haskell-keyword">instance</span> <span class="org-haskell-type">Num</span> a <span class="org-haskell-operator">=&gt;</span> <span class="org-haskell-type">Monoid</span> (<span class="org-haskell-type">Sum</span> a) <span class="org-haskell-keyword">where</span>
        mempty <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Sum</span> 0
        mappend <span class="org-haskell-operator">=</span> coerce ((<span class="org-haskell-operator">+</span>) <span class="org-haskell-operator">::</span> a <span class="org-haskell-operator">-&gt;</span> a <span class="org-haskell-operator">-&gt;</span> a)
<span class="org-comment-delimiter">--        </span><span class="org-comment">Sum x `mappend` Sum y = Sum (x + y)</span>
</pre>
</div>

<p>
Example:
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-operator">&gt;&gt;&gt;</span> <span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">Data.Monoid</span>


<span class="org-comment-delimiter">{- </span><span class="org-comment">Sum Monoid</span>
<span class="org-comment"> ----------------------------------}</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>t <span class="org-haskell-constructor">Sum</span> 
<span class="org-function-name">Sum</span> <span class="org-haskell-operator">::</span> a <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Sum</span> a
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-type">Sum</span> 10 
<span class="org-haskell-constructor">Sum</span> {getSum <span class="org-haskell-operator">=</span> 10}
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>t getSum 
<span class="org-function-name">getSum</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Sum</span> a <span class="org-haskell-operator">-&gt;</span> a
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;&gt;&gt;</span> mempty <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Sum</span> <span class="org-haskell-type">Int</span>
<span class="org-haskell-constructor">Sum</span> {getSum <span class="org-haskell-operator">=</span> 0}

<span class="org-haskell-operator">&gt;&gt;&gt;</span> mempty <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Product</span> <span class="org-haskell-type">Int</span>
<span class="org-haskell-constructor">Product</span> {getProduct <span class="org-haskell-operator">=</span> 1}
<span class="org-haskell-operator">&gt;&gt;&gt;</span>

<span class="org-haskell-operator">&gt;&gt;&gt;</span> getSum (mempty <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Sum</span> <span class="org-haskell-type">Int</span>)
0

<span class="org-haskell-operator">&gt;&gt;&gt;</span> 1 <span class="org-haskell-operator">&lt;&gt;</span> mempty <span class="org-haskell-operator">&lt;&gt;</span> 2 <span class="org-haskell-operator">&lt;&gt;</span> 3 <span class="org-haskell-operator">&lt;&gt;</span> 10 <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Sum</span> <span class="org-haskell-type">Int</span>
<span class="org-haskell-constructor">Sum</span> {getSum <span class="org-haskell-operator">=</span> 16}
<span class="org-haskell-operator">&gt;&gt;&gt;</span>

<span class="org-haskell-operator">&gt;&gt;&gt;</span> 1 <span class="org-haskell-operator">`mappend`</span> mempty <span class="org-haskell-operator">`mappend`</span> 2 <span class="org-haskell-operator">`mappend`</span> 3 <span class="org-haskell-operator">`mappend`</span> 10 <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Sum</span> <span class="org-haskell-type">Int</span>
<span class="org-haskell-constructor">Sum</span> {getSum <span class="org-haskell-operator">=</span> 16}
<span class="org-haskell-operator">&gt;&gt;&gt;</span>

<span class="org-haskell-operator">&gt;&gt;&gt;</span> mconcat [1, mempty, 2, 3, 10] <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Sum</span> <span class="org-haskell-type">Int</span>
<span class="org-haskell-constructor">Sum</span> {getSum <span class="org-haskell-operator">=</span> 16}
<span class="org-haskell-operator">&gt;&gt;&gt;</span>

<span class="org-haskell-operator">&gt;&gt;&gt;</span> getSum ( mconcat [1, mempty, 2, 3, 10] <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Sum</span> <span class="org-haskell-type">Int</span>)
16
<span class="org-haskell-operator">&gt;&gt;&gt;</span>
</pre>
</div>
</div>
</div>
