haskell/monoids.org
**** Product


| Function        |    | Signature                           | Description                     |
|-----------------+----+-------------------------------------+---------------------------------|
| Monoid instance |    | Product { getProduct :: a }         |                                 |
|                 |    |                                     |                                 |
| mempty          | :: | Product 1                           | Identity element                |
| mappend         | :: | Product a -> Product a -> Product a | Binary operation is product (*) |
| moncat          | :: | [Product a] -> Product a            | Product of all numbers in list  |
| <>              | :: | Prduct a -> Product a -> Product a  | Alias to mappend.               |
|                 |    |                                     |                                 |




#+BEGIN_SRC haskell
-- | Monoid under multiplication.
newtype Product a = Product { getProduct :: a }
        deriving (Eq, Ord, Read, Show, Bounded, Generic, Generic1, Num)

instance Num a => Monoid (Product a) where
        mempty = Product 1
        mappend = coerce ((*) :: a -> a -> a)
--        Product x `mappend` Product y = Product (x * y)
#+END_SRC

Example:

#+BEGIN_SRC haskell
>>> import Data.Monoid


{- Product Monoid
 ---------------------------------}

>>> 2 <> mempty :: Product Int
Product {getProduct = 2}
>>> mempty <> mempty :: Product Int
Product {getProduct = 1}
>>> mempty <> 2 :: Product Int
Product {getProduct = 2}
>>>

>>> getProduct (mempty :: Product Int)
1
>>>

>>> 2 <> 3 :: Product Int
Product {getProduct = 6}
>>>
>>> getProduct (2 <> 3 :: Product Int)
6
>>>

>>> mconcat [1, 2, 3, 4, 5, mempty] :: Product Int
Product {getProduct = 120}
>>>

>>> getProduct ( mconcat [1, 2, 3, 4, 5, mempty] :: Product Int)
120
>>>

:{
let value :: Product Int
    value = mconcat [1, 2, 3, 4, 5, mempty]
:}

>>> value
Product {getProduct = 120}
>>>

#+END_SRC

