haskell/monoids.html

<div id="outline-container-sec-1-1-2-4" class="outline-5">
<h5 id="sec-1-1-2-4"><span class="section-number-5">1.1.2.4</span> Product</h5>
<div class="outline-text-5" id="text-1-1-2-4">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">Function</th>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">Signature</th>
<th scope="col" class="left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">Monoid instance</td>
<td class="left">&#xa0;</td>
<td class="left">Product { getProduct :: a }</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">mempty</td>
<td class="left">::</td>
<td class="left">Product 1</td>
<td class="left">Identity element</td>
</tr>

<tr>
<td class="left">mappend</td>
<td class="left">::</td>
<td class="left">Product a -&gt; Product a -&gt; Product a</td>
<td class="left">Binary operation is product (*)</td>
</tr>

<tr>
<td class="left">moncat</td>
<td class="left">::</td>
<td class="left">[Product a] -&gt; Product a</td>
<td class="left">Product of all numbers in list</td>
</tr>

<tr>
<td class="left">&lt;&gt;</td>
<td class="left">::</td>
<td class="left">Prduct a -&gt; Product a -&gt; Product a</td>
<td class="left">Alias to mappend.</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
</table>




<div class="org-src-container">

<pre class="src src-haskell"><span class="org-doc">-- | Monoid under multiplication.</span>
<span class="org-haskell-keyword">newtype</span> <span class="org-haskell-type">Product</span> a <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Product</span> { getProduct <span class="org-haskell-operator">::</span> a }
        <span class="org-haskell-keyword">deriving</span> (<span class="org-haskell-constructor">Eq</span>, <span class="org-haskell-constructor">Ord</span>, <span class="org-haskell-constructor">Read</span>, <span class="org-haskell-constructor">Show</span>, <span class="org-haskell-constructor">Bounded</span>, <span class="org-haskell-constructor">Generic</span>, <span class="org-haskell-constructor">Generic1</span>, <span class="org-haskell-constructor">Num</span>)

<span class="org-haskell-keyword">instance</span> <span class="org-haskell-type">Num</span> a <span class="org-haskell-operator">=&gt;</span> <span class="org-haskell-type">Monoid</span> (<span class="org-haskell-type">Product</span> a) <span class="org-haskell-keyword">where</span>
        mempty <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Product</span> 1
        mappend <span class="org-haskell-operator">=</span> coerce ((<span class="org-haskell-operator">*</span>) <span class="org-haskell-operator">::</span> a <span class="org-haskell-operator">-&gt;</span> a <span class="org-haskell-operator">-&gt;</span> a)
<span class="org-comment-delimiter">--        </span><span class="org-comment">Product x `mappend` Product y = Product (x * y)</span>
</pre>
</div>

<p>
Example:
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-operator">&gt;&gt;&gt;</span> <span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">Data.Monoid</span>


<span class="org-comment-delimiter">{- </span><span class="org-comment">Product Monoid</span>
<span class="org-comment"> ---------------------------------}</span>

<span class="org-haskell-operator">&gt;&gt;&gt;</span> 2 <span class="org-haskell-operator">&lt;&gt;</span> mempty <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Product</span> <span class="org-haskell-type">Int</span>
<span class="org-haskell-constructor">Product</span> {getProduct <span class="org-haskell-operator">=</span> 2}
<span class="org-haskell-operator">&gt;&gt;&gt;</span> mempty <span class="org-haskell-operator">&lt;&gt;</span> mempty <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Product</span> <span class="org-haskell-type">Int</span>
<span class="org-haskell-constructor">Product</span> {getProduct <span class="org-haskell-operator">=</span> 1}
<span class="org-haskell-operator">&gt;&gt;&gt;</span> mempty <span class="org-haskell-operator">&lt;&gt;</span> 2 <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Product</span> <span class="org-haskell-type">Int</span>
<span class="org-haskell-constructor">Product</span> {getProduct <span class="org-haskell-operator">=</span> 2}
<span class="org-haskell-operator">&gt;&gt;&gt;</span>

<span class="org-haskell-operator">&gt;&gt;&gt;</span> getProduct (mempty <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Product</span> <span class="org-haskell-type">Int</span>)
1
<span class="org-haskell-operator">&gt;&gt;&gt;</span>

<span class="org-haskell-operator">&gt;&gt;&gt;</span> 2 <span class="org-haskell-operator">&lt;&gt;</span> 3 <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Product</span> <span class="org-haskell-type">Int</span>
<span class="org-haskell-constructor">Product</span> {getProduct <span class="org-haskell-operator">=</span> 6}
<span class="org-haskell-operator">&gt;&gt;&gt;</span>
<span class="org-haskell-operator">&gt;&gt;&gt;</span> getProduct (2 <span class="org-haskell-operator">&lt;&gt;</span> 3 <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Product</span> <span class="org-haskell-type">Int</span>)
6
<span class="org-haskell-operator">&gt;&gt;&gt;</span>

<span class="org-haskell-operator">&gt;&gt;&gt;</span> mconcat [1, 2, 3, 4, 5, mempty] <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Product</span> <span class="org-haskell-type">Int</span>
<span class="org-haskell-constructor">Product</span> {getProduct <span class="org-haskell-operator">=</span> 120}
<span class="org-haskell-operator">&gt;&gt;&gt;</span>

<span class="org-haskell-operator">&gt;&gt;&gt;</span> getProduct ( mconcat [1, 2, 3, 4, 5, mempty] <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Product</span> <span class="org-haskell-type">Int</span>)
120
<span class="org-haskell-operator">&gt;&gt;&gt;</span>

<span class="org-haskell-constructor">:</span>{
<span class="org-haskell-keyword">let</span> value <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Product</span> <span class="org-haskell-type">Int</span>
    value <span class="org-haskell-operator">=</span> mconcat [1, 2, 3, 4, 5, mempty]
<span class="org-haskell-constructor">:</span>}

<span class="org-haskell-operator">&gt;&gt;&gt;</span> value
<span class="org-haskell-constructor">Product</span> {getProduct <span class="org-haskell-operator">=</span> 120}
<span class="org-haskell-operator">&gt;&gt;&gt;</span>
</pre>
</div>
</div>
</div>
