haskell/monoids.org
**** Maybe

It is useful to deal with monoids resulting from failed
computations.

The contents of Maybe must be an instance of Monoid type
class.

#+BEGIN_SRC haskell
instance Monoid a => Monoid (Maybe a) where

  mempty = Nothing

  Nothing `mappend` m       = m
  m       `mappend` Nothing = m
  Just m1 `mappend` Just m2 = Just (m1 `mappend` m2)
#+END_SRC

Example:

#+BEGIN_SRC haskell
>>> mempty :: Maybe String
Nothing
>>>

>>> Just "Hello " `mappend` Just "World"
Just "Hello World"
>>>

>>> Just "Hello "  `mappend` Nothing
Just "Hello "
>>>

>>> Nothing  `mappend` Just "World"
Just "World"
>>>

>>> Nothing `mappend` Nothing
Nothing
>>>


>>> Just "Hello " <> Nothing
Just "Hello "
>>>

>>> Just "Hello " <>  Just "World"
Just "Hello World"
>>>

>>> Just "Hello " <>  Just "World" <> Just " Haskell" <> Just " rocks!"
Just "Hello World Haskell rocks!"
>>>

>>> Just "Hello " <>  Nothing <> Nothing  <> Just " rocks!"
Just "Hello  rocks!"
>>>

>>> mconcat [Just "Hello ", Nothing, Just " Haskell", Just " rocks"]
Just "Hello  Haskell rocks"
>>>

>>> mconcat [Nothing, Nothing]
Nothing
>>>

>>> mconcat [] :: Maybe String
Nothing
>>>


>>> Just (Product 4) <> Just (Product 5)
Just (Product {getProduct = 20})
>>>

>>> Just (Product 4) <> Nothing
Just (Product {getProduct = 4})
>>>

>>> Just (Product 4)  <> Nothing <> Just (Product 5) <> Just (Product 3)
Just (Product {getProduct = 60})
>>>

>>> mconcat [Just $ Sum 2, Just $ Sum 3, Nothing, Just $ Sum 10, Nothing]
Just (Sum {getSum = 15})
>>>

>>> fmap getSum $ mconcat [Just $ Sum 2, Just $ Sum 3, Nothing, Just $ Sum 10, Nothing]
Just 15
>>>

>>> getSum <$> mconcat [Just $ Sum 2, Just $ Sum 3, Nothing, Just $ Sum 10, Nothing]
Just 15
>>>
#+END_SRC

