haskell/monoids.html

<div id="outline-container-sec-1-1-2-5" class="outline-5">
<h5 id="sec-1-1-2-5"><span class="section-number-5">1.1.2.5</span> Maybe</h5>
<div class="outline-text-5" id="text-1-1-2-5">
<p>
It is useful to deal with monoids resulting from failed
computations.
</p>

<p>
The contents of Maybe must be an instance of Monoid type
class.
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-keyword">instance</span> <span class="org-haskell-type">Monoid</span> a <span class="org-haskell-operator">=&gt;</span> <span class="org-haskell-type">Monoid</span> (<span class="org-haskell-type">Maybe</span> a) <span class="org-haskell-keyword">where</span>

  mempty <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Nothing</span>

  <span class="org-haskell-constructor">Nothing</span> <span class="org-haskell-operator">`mappend`</span> m       <span class="org-haskell-operator">=</span> m
  m       <span class="org-haskell-operator">`mappend`</span> <span class="org-haskell-constructor">Nothing</span> <span class="org-haskell-operator">=</span> m
  <span class="org-haskell-constructor">Just</span> m1 <span class="org-haskell-operator">`mappend`</span> <span class="org-haskell-constructor">Just</span> m2 <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Just</span> (m1 <span class="org-haskell-operator">`mappend`</span> m2)
</pre>
</div>

<p>
Example:
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-operator">&gt;&gt;&gt;</span> mempty <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Maybe</span> <span class="org-haskell-type">String</span>
<span class="org-haskell-constructor">Nothing</span>
<span class="org-haskell-operator">&gt;&gt;&gt;</span>

<span class="org-haskell-operator">&gt;&gt;&gt;</span> <span class="org-haskell-constructor">Just</span> <span class="org-string">"Hello "</span> <span class="org-haskell-operator">`mappend`</span> <span class="org-haskell-constructor">Just</span> <span class="org-string">"World"</span>
<span class="org-haskell-constructor">Just</span> <span class="org-string">"Hello World"</span>
<span class="org-haskell-operator">&gt;&gt;&gt;</span>

<span class="org-haskell-operator">&gt;&gt;&gt;</span> <span class="org-haskell-constructor">Just</span> <span class="org-string">"Hello "</span>  <span class="org-haskell-operator">`mappend`</span> <span class="org-haskell-constructor">Nothing</span>
<span class="org-haskell-constructor">Just</span> <span class="org-string">"Hello "</span>
<span class="org-haskell-operator">&gt;&gt;&gt;</span>

<span class="org-haskell-operator">&gt;&gt;&gt;</span> <span class="org-haskell-constructor">Nothing</span>  <span class="org-haskell-operator">`mappend`</span> <span class="org-haskell-constructor">Just</span> <span class="org-string">"World"</span>
<span class="org-haskell-constructor">Just</span> <span class="org-string">"World"</span>
<span class="org-haskell-operator">&gt;&gt;&gt;</span>

<span class="org-haskell-operator">&gt;&gt;&gt;</span> <span class="org-haskell-constructor">Nothing</span> <span class="org-haskell-operator">`mappend`</span> <span class="org-haskell-constructor">Nothing</span>
<span class="org-haskell-constructor">Nothing</span>
<span class="org-haskell-operator">&gt;&gt;&gt;</span>


<span class="org-haskell-operator">&gt;&gt;&gt;</span> <span class="org-haskell-constructor">Just</span> <span class="org-string">"Hello "</span> <span class="org-haskell-operator">&lt;&gt;</span> <span class="org-haskell-constructor">Nothing</span>
<span class="org-haskell-constructor">Just</span> <span class="org-string">"Hello "</span>
<span class="org-haskell-operator">&gt;&gt;&gt;</span>

<span class="org-haskell-operator">&gt;&gt;&gt;</span> <span class="org-haskell-constructor">Just</span> <span class="org-string">"Hello "</span> <span class="org-haskell-operator">&lt;&gt;</span>  <span class="org-haskell-constructor">Just</span> <span class="org-string">"World"</span>
<span class="org-haskell-constructor">Just</span> <span class="org-string">"Hello World"</span>
<span class="org-haskell-operator">&gt;&gt;&gt;</span>

<span class="org-haskell-operator">&gt;&gt;&gt;</span> <span class="org-haskell-constructor">Just</span> <span class="org-string">"Hello "</span> <span class="org-haskell-operator">&lt;&gt;</span>  <span class="org-haskell-constructor">Just</span> <span class="org-string">"World"</span> <span class="org-haskell-operator">&lt;&gt;</span> <span class="org-haskell-constructor">Just</span> <span class="org-string">" Haskell"</span> <span class="org-haskell-operator">&lt;&gt;</span> <span class="org-haskell-constructor">Just</span> <span class="org-string">" rocks!"</span>
<span class="org-haskell-constructor">Just</span> <span class="org-string">"Hello World Haskell rocks!"</span>
<span class="org-haskell-operator">&gt;&gt;&gt;</span>

<span class="org-haskell-operator">&gt;&gt;&gt;</span> <span class="org-haskell-constructor">Just</span> <span class="org-string">"Hello "</span> <span class="org-haskell-operator">&lt;&gt;</span>  <span class="org-haskell-constructor">Nothing</span> <span class="org-haskell-operator">&lt;&gt;</span> <span class="org-haskell-constructor">Nothing</span>  <span class="org-haskell-operator">&lt;&gt;</span> <span class="org-haskell-constructor">Just</span> <span class="org-string">" rocks!"</span>
<span class="org-haskell-constructor">Just</span> <span class="org-string">"Hello  rocks!"</span>
<span class="org-haskell-operator">&gt;&gt;&gt;</span>

<span class="org-haskell-operator">&gt;&gt;&gt;</span> mconcat [<span class="org-haskell-constructor">Just</span> <span class="org-string">"Hello "</span>, <span class="org-haskell-constructor">Nothing</span>, <span class="org-haskell-constructor">Just</span> <span class="org-string">" Haskell"</span>, <span class="org-haskell-constructor">Just</span> <span class="org-string">" rocks"</span>]
<span class="org-haskell-constructor">Just</span> <span class="org-string">"Hello  Haskell rocks"</span>
<span class="org-haskell-operator">&gt;&gt;&gt;</span>

<span class="org-haskell-operator">&gt;&gt;&gt;</span> mconcat [<span class="org-haskell-constructor">Nothing</span>, <span class="org-haskell-constructor">Nothing</span>]
<span class="org-haskell-constructor">Nothing</span>
<span class="org-haskell-operator">&gt;&gt;&gt;</span>

<span class="org-haskell-operator">&gt;&gt;&gt;</span> mconcat <span class="org-haskell-constructor">[]</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Maybe</span> <span class="org-haskell-type">String</span>
<span class="org-haskell-constructor">Nothing</span>
<span class="org-haskell-operator">&gt;&gt;&gt;</span>


<span class="org-haskell-operator">&gt;&gt;&gt;</span> <span class="org-haskell-constructor">Just</span> (<span class="org-haskell-constructor">Product</span> 4) <span class="org-haskell-operator">&lt;&gt;</span> <span class="org-haskell-constructor">Just</span> (<span class="org-haskell-constructor">Product</span> 5)
<span class="org-haskell-constructor">Just</span> (<span class="org-haskell-constructor">Product</span> {getProduct <span class="org-haskell-operator">=</span> 20})
<span class="org-haskell-operator">&gt;&gt;&gt;</span>

<span class="org-haskell-operator">&gt;&gt;&gt;</span> <span class="org-haskell-constructor">Just</span> (<span class="org-haskell-constructor">Product</span> 4) <span class="org-haskell-operator">&lt;&gt;</span> <span class="org-haskell-constructor">Nothing</span>
<span class="org-haskell-constructor">Just</span> (<span class="org-haskell-constructor">Product</span> {getProduct <span class="org-haskell-operator">=</span> 4})
<span class="org-haskell-operator">&gt;&gt;&gt;</span>

<span class="org-haskell-operator">&gt;&gt;&gt;</span> <span class="org-haskell-constructor">Just</span> (<span class="org-haskell-constructor">Product</span> 4)  <span class="org-haskell-operator">&lt;&gt;</span> <span class="org-haskell-constructor">Nothing</span> <span class="org-haskell-operator">&lt;&gt;</span> <span class="org-haskell-constructor">Just</span> (<span class="org-haskell-constructor">Product</span> 5) <span class="org-haskell-operator">&lt;&gt;</span> <span class="org-haskell-constructor">Just</span> (<span class="org-haskell-constructor">Product</span> 3)
<span class="org-haskell-constructor">Just</span> (<span class="org-haskell-constructor">Product</span> {getProduct <span class="org-haskell-operator">=</span> 60})
<span class="org-haskell-operator">&gt;&gt;&gt;</span>

<span class="org-haskell-operator">&gt;&gt;&gt;</span> mconcat [<span class="org-haskell-constructor">Just</span> <span class="org-haskell-operator">$</span> <span class="org-haskell-constructor">Sum</span> 2, <span class="org-haskell-constructor">Just</span> <span class="org-haskell-operator">$</span> <span class="org-haskell-constructor">Sum</span> 3, <span class="org-haskell-constructor">Nothing</span>, <span class="org-haskell-constructor">Just</span> <span class="org-haskell-operator">$</span> <span class="org-haskell-constructor">Sum</span> 10, <span class="org-haskell-constructor">Nothing</span>]
<span class="org-haskell-constructor">Just</span> (<span class="org-haskell-constructor">Sum</span> {getSum <span class="org-haskell-operator">=</span> 15})
<span class="org-haskell-operator">&gt;&gt;&gt;</span>

<span class="org-haskell-operator">&gt;&gt;&gt;</span> fmap getSum <span class="org-haskell-operator">$</span> mconcat [<span class="org-haskell-constructor">Just</span> <span class="org-haskell-operator">$</span> <span class="org-haskell-constructor">Sum</span> 2, <span class="org-haskell-constructor">Just</span> <span class="org-haskell-operator">$</span> <span class="org-haskell-constructor">Sum</span> 3, <span class="org-haskell-constructor">Nothing</span>, <span class="org-haskell-constructor">Just</span> <span class="org-haskell-operator">$</span> <span class="org-haskell-constructor">Sum</span> 10, <span class="org-haskell-constructor">Nothing</span>]
<span class="org-haskell-constructor">Just</span> 15
<span class="org-haskell-operator">&gt;&gt;&gt;</span>

<span class="org-haskell-operator">&gt;&gt;&gt;</span> getSum <span class="org-haskell-operator">&lt;$&gt;</span> mconcat [<span class="org-haskell-constructor">Just</span> <span class="org-haskell-operator">$</span> <span class="org-haskell-constructor">Sum</span> 2, <span class="org-haskell-constructor">Just</span> <span class="org-haskell-operator">$</span> <span class="org-haskell-constructor">Sum</span> 3, <span class="org-haskell-constructor">Nothing</span>, <span class="org-haskell-constructor">Just</span> <span class="org-haskell-operator">$</span> <span class="org-haskell-constructor">Sum</span> 10, <span class="org-haskell-constructor">Nothing</span>]
<span class="org-haskell-constructor">Just</span> 15
<span class="org-haskell-operator">&gt;&gt;&gt;</span>
</pre>
</div>
</div>
</div>
