haskell/monoids.org
**** First

Gets the first Just value of the two operands. The content of Maybe
doesn't need to be a instance of Monoid type class.

#+BEGIN_SRC haskell
newtype First a = First { getFirst :: Maybe a }
     deriving (Eq, Ord, Read, Show)


instance Monoid (First a) where

     mempty = First Nothing

     First (Just x) `mappend` _ = First (Just x)
     First Nothing  `mappend` x = x
#+END_SRC


Example:

#+BEGIN_SRC haskell
>>> First (Just 100)
First {getFirst = Just 100}
>>>

>>> getFirst $ First (Just 100)
Just 100
>>>

>>> getFirst $ First Nothing
Nothing
>>>

>>> First (Just 100) <> First Nothing
First {getFirst = Just 100}
>>>

>>> First (Just 100) <> First (Just 10)
First {getFirst = Just 100}
>>>

>>> First Nothing <> First (Just 10)
First {getFirst = Just 10}
>>>

>>> First Nothing <> First Nothing
First {getFirst = Nothing}
>>>

>>> mconcat [First Nothing, First (Just 10), First (Just 2)]
First {getFirst = Just 10}

>>> mconcat [First Nothing, First Nothing, First (Just 2)]
First {getFirst = Just 2}
>>>

>>> mconcat [First Nothing, First Nothing, First Nothing]
First {getFirst = Nothing}
>>>


#+END_SRC

