haskell/monoids.html

<div id="outline-container-sec-1-1-2-6" class="outline-5">
<h5 id="sec-1-1-2-6"><span class="section-number-5">1.1.2.6</span> First</h5>
<div class="outline-text-5" id="text-1-1-2-6">
<p>
Gets the first Just value of the two operands. The content of Maybe
doesn't need to be a instance of Monoid type class.
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-keyword">newtype</span> <span class="org-haskell-type">First</span> a <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">First</span> { getFirst <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Maybe</span> a }
     <span class="org-haskell-keyword">deriving</span> (<span class="org-haskell-constructor">Eq</span>, <span class="org-haskell-constructor">Ord</span>, <span class="org-haskell-constructor">Read</span>, <span class="org-haskell-constructor">Show</span>)


<span class="org-haskell-keyword">instance</span> <span class="org-haskell-type">Monoid</span> (<span class="org-haskell-type">First</span> a) <span class="org-haskell-keyword">where</span>

     mempty <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">First</span> <span class="org-haskell-constructor">Nothing</span>

     <span class="org-haskell-constructor">First</span> (<span class="org-haskell-constructor">Just</span> x) <span class="org-haskell-operator">`mappend`</span> <span class="org-haskell-keyword">_</span> <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">First</span> (<span class="org-haskell-constructor">Just</span> x)
     <span class="org-haskell-constructor">First</span> <span class="org-haskell-constructor">Nothing</span>  <span class="org-haskell-operator">`mappend`</span> x <span class="org-haskell-operator">=</span> x
</pre>
</div>


<p>
Example:
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-operator">&gt;&gt;&gt;</span> <span class="org-haskell-constructor">First</span> (<span class="org-haskell-constructor">Just</span> 100)
<span class="org-haskell-constructor">First</span> {getFirst <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Just</span> 100}
<span class="org-haskell-operator">&gt;&gt;&gt;</span>

<span class="org-haskell-operator">&gt;&gt;&gt;</span> getFirst <span class="org-haskell-operator">$</span> <span class="org-haskell-constructor">First</span> (<span class="org-haskell-constructor">Just</span> 100)
<span class="org-haskell-constructor">Just</span> 100
<span class="org-haskell-operator">&gt;&gt;&gt;</span>

<span class="org-haskell-operator">&gt;&gt;&gt;</span> getFirst <span class="org-haskell-operator">$</span> <span class="org-haskell-constructor">First</span> <span class="org-haskell-constructor">Nothing</span>
<span class="org-haskell-constructor">Nothing</span>
<span class="org-haskell-operator">&gt;&gt;&gt;</span>

<span class="org-haskell-operator">&gt;&gt;&gt;</span> <span class="org-haskell-constructor">First</span> (<span class="org-haskell-constructor">Just</span> 100) <span class="org-haskell-operator">&lt;&gt;</span> <span class="org-haskell-constructor">First</span> <span class="org-haskell-constructor">Nothing</span>
<span class="org-haskell-constructor">First</span> {getFirst <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Just</span> 100}
<span class="org-haskell-operator">&gt;&gt;&gt;</span>

<span class="org-haskell-operator">&gt;&gt;&gt;</span> <span class="org-haskell-constructor">First</span> (<span class="org-haskell-constructor">Just</span> 100) <span class="org-haskell-operator">&lt;&gt;</span> <span class="org-haskell-constructor">First</span> (<span class="org-haskell-constructor">Just</span> 10)
<span class="org-haskell-constructor">First</span> {getFirst <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Just</span> 100}
<span class="org-haskell-operator">&gt;&gt;&gt;</span>

<span class="org-haskell-operator">&gt;&gt;&gt;</span> <span class="org-haskell-constructor">First</span> <span class="org-haskell-constructor">Nothing</span> <span class="org-haskell-operator">&lt;&gt;</span> <span class="org-haskell-constructor">First</span> (<span class="org-haskell-constructor">Just</span> 10)
<span class="org-haskell-constructor">First</span> {getFirst <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Just</span> 10}
<span class="org-haskell-operator">&gt;&gt;&gt;</span>

<span class="org-haskell-operator">&gt;&gt;&gt;</span> <span class="org-haskell-constructor">First</span> <span class="org-haskell-constructor">Nothing</span> <span class="org-haskell-operator">&lt;&gt;</span> <span class="org-haskell-constructor">First</span> <span class="org-haskell-constructor">Nothing</span>
<span class="org-haskell-constructor">First</span> {getFirst <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Nothing</span>}
<span class="org-haskell-operator">&gt;&gt;&gt;</span>

<span class="org-haskell-operator">&gt;&gt;&gt;</span> mconcat [<span class="org-haskell-constructor">First</span> <span class="org-haskell-constructor">Nothing</span>, <span class="org-haskell-constructor">First</span> (<span class="org-haskell-constructor">Just</span> 10), <span class="org-haskell-constructor">First</span> (<span class="org-haskell-constructor">Just</span> 2)]
<span class="org-haskell-constructor">First</span> {getFirst <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Just</span> 10}

<span class="org-haskell-operator">&gt;&gt;&gt;</span> mconcat [<span class="org-haskell-constructor">First</span> <span class="org-haskell-constructor">Nothing</span>, <span class="org-haskell-constructor">First</span> <span class="org-haskell-constructor">Nothing</span>, <span class="org-haskell-constructor">First</span> (<span class="org-haskell-constructor">Just</span> 2)]
<span class="org-haskell-constructor">First</span> {getFirst <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Just</span> 2}
<span class="org-haskell-operator">&gt;&gt;&gt;</span>

<span class="org-haskell-operator">&gt;&gt;&gt;</span> mconcat [<span class="org-haskell-constructor">First</span> <span class="org-haskell-constructor">Nothing</span>, <span class="org-haskell-constructor">First</span> <span class="org-haskell-constructor">Nothing</span>, <span class="org-haskell-constructor">First</span> <span class="org-haskell-constructor">Nothing</span>]
<span class="org-haskell-constructor">First</span> {getFirst <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Nothing</span>}
<span class="org-haskell-operator">&gt;&gt;&gt;</span>
</pre>
</div>
</div>
</div>
