haskell/monoids.org
**** Last

Gets the last Just value of two operands. The contents of Maybe
doesn't need to be a instance of Monoid.

#+BEGIN_SRC haskell
newtype Last a = Last { getLast :: Maybe a }
        deriving (Eq, Ord, Read, Show, Generic, Generic1,
                  Functor, Applicative, Monad)

instance Monoid (Last a) where
        mempty = Last Nothing
        l `mappend` Last Nothing = l
        _ `mappend` r            = r
#+END_SRC

Example:

#+BEGIN_SRC haskell
>>> import Data.Monoid
>>>

>>> :info Last
newtype Last a = Last {getLast :: Maybe a}
  	-- Defined in ‘Data.Monoid’
instance Eq a => Eq (Last a) -- Defined in ‘Data.Monoid’
instance Monad Last -- Defined in ‘Data.Monoid’
instance Functor Last -- Defined in ‘Data.Monoid’
instance Ord a => Ord (Last a) -- Defined in ‘Data.Monoid’
instance Read a => Read (Last a) -- Defined in ‘Data.Monoid’
instance Show a => Show (Last a) -- Defined in ‘Data.Monoid’
instance Applicative Last -- Defined in ‘Data.Monoid’
instance Monoid (Last a) -- Defined in ‘Data.Monoid’
>>>

>>> Last Nothing
Last {getLast = Nothing}
>>> Last (Just 100)
Last {getLast = Just 100}
>>>

>>> getLast $ Last (Just 100)
Just 100
>>> getLast $ Last Nothing
Nothing
>>>

>>> Last (Just 10) <> Last (Just 100)
Last {getLast = Just 100}
>>>
>>> Last Nothing `mappend` Last (Just 100)
Last {getLast = Just 100}
>>>
>>> Last (Just 10) <> Last Nothing
Last {getLast = Just 10}
>>>
>>> Last Nothing <> Last (Just 100)
Last {getLast = Just 100}
>>>
>>> Last Nothing <> Last Nothing
Last {getLast = Nothing}
>>>

>>> mconcat [Last (Just 10), Last (Just 2), Last Nothing, Last (Just 3)]
Last {getLast = Just 3}
>>>

>>> mconcat [Last (Just 6),  Last Nothing, Last (Just 3)]
Last {getLast = Just 3}
>>>

>>> mconcat [Last (Just 6),  Last Nothing]
Last {getLast = Just 6}
>>>

>>> mconcat [Last Nothing]
Last {getLast = Nothing}
>>>


#+END_SRC

