haskell/monoids.html

<div id="outline-container-sec-1-1-2-7" class="outline-5">
<h5 id="sec-1-1-2-7"><span class="section-number-5">1.1.2.7</span> Last</h5>
<div class="outline-text-5" id="text-1-1-2-7">
<p>
Gets the last Just value of two operands. The contents of Maybe
doesn't need to be a instance of Monoid.
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-keyword">newtype</span> <span class="org-haskell-type">Last</span> a <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Last</span> { getLast <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Maybe</span> a }
        <span class="org-haskell-keyword">deriving</span> (<span class="org-haskell-constructor">Eq</span>, <span class="org-haskell-constructor">Ord</span>, <span class="org-haskell-constructor">Read</span>, <span class="org-haskell-constructor">Show</span>, <span class="org-haskell-constructor">Generic</span>, <span class="org-haskell-constructor">Generic1</span>,
                  <span class="org-haskell-constructor">Functor</span>, <span class="org-haskell-constructor">Applicative</span>, <span class="org-haskell-constructor">Monad</span>)

<span class="org-haskell-keyword">instance</span> <span class="org-haskell-type">Monoid</span> (<span class="org-haskell-type">Last</span> a) <span class="org-haskell-keyword">where</span>
        mempty <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Last</span> <span class="org-haskell-constructor">Nothing</span>
        l <span class="org-haskell-operator">`mappend`</span> <span class="org-haskell-constructor">Last</span> <span class="org-haskell-constructor">Nothing</span> <span class="org-haskell-operator">=</span> l
        <span class="org-haskell-keyword">_</span> <span class="org-haskell-operator">`mappend`</span> r            <span class="org-haskell-operator">=</span> r
</pre>
</div>

<p>
Example:
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-operator">&gt;&gt;&gt;</span> <span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">Data.Monoid</span>
<span class="org-haskell-operator">&gt;&gt;&gt;</span>

<span class="org-haskell-operator">&gt;&gt;&gt;</span> <span class="org-haskell-constructor">:</span>info <span class="org-haskell-constructor">Last</span>
<span class="org-haskell-keyword">newtype</span> <span class="org-haskell-type">Last</span> a <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Last</span> {getLast <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Maybe</span> a}
    <span class="org-comment-delimiter">-- </span><span class="org-comment">Defined in &#8216;Data.Monoid&#8217;</span>
<span class="org-haskell-keyword">instance</span> <span class="org-haskell-type">Eq</span> a <span class="org-haskell-operator">=&gt;</span> <span class="org-haskell-type">Eq</span> (<span class="org-haskell-type">Last</span> a) <span class="org-comment-delimiter">-- </span><span class="org-comment">Defined in &#8216;Data.Monoid&#8217;</span>
<span class="org-haskell-keyword">instance</span> <span class="org-haskell-type">Monad</span> <span class="org-haskell-type">Last</span> <span class="org-comment-delimiter">-- </span><span class="org-comment">Defined in &#8216;Data.Monoid&#8217;</span>
<span class="org-haskell-keyword">instance</span> <span class="org-haskell-type">Functor</span> <span class="org-haskell-type">Last</span> <span class="org-comment-delimiter">-- </span><span class="org-comment">Defined in &#8216;Data.Monoid&#8217;</span>
<span class="org-haskell-keyword">instance</span> <span class="org-haskell-type">Ord</span> a <span class="org-haskell-operator">=&gt;</span> <span class="org-haskell-type">Ord</span> (<span class="org-haskell-type">Last</span> a) <span class="org-comment-delimiter">-- </span><span class="org-comment">Defined in &#8216;Data.Monoid&#8217;</span>
<span class="org-haskell-keyword">instance</span> <span class="org-haskell-type">Read</span> a <span class="org-haskell-operator">=&gt;</span> <span class="org-haskell-type">Read</span> (<span class="org-haskell-type">Last</span> a) <span class="org-comment-delimiter">-- </span><span class="org-comment">Defined in &#8216;Data.Monoid&#8217;</span>
<span class="org-haskell-keyword">instance</span> <span class="org-haskell-type">Show</span> a <span class="org-haskell-operator">=&gt;</span> <span class="org-haskell-type">Show</span> (<span class="org-haskell-type">Last</span> a) <span class="org-comment-delimiter">-- </span><span class="org-comment">Defined in &#8216;Data.Monoid&#8217;</span>
<span class="org-haskell-keyword">instance</span> <span class="org-haskell-type">Applicative</span> <span class="org-haskell-type">Last</span> <span class="org-comment-delimiter">-- </span><span class="org-comment">Defined in &#8216;Data.Monoid&#8217;</span>
<span class="org-haskell-keyword">instance</span> <span class="org-haskell-type">Monoid</span> (<span class="org-haskell-type">Last</span> a) <span class="org-comment-delimiter">-- </span><span class="org-comment">Defined in &#8216;Data.Monoid&#8217;</span>
<span class="org-haskell-operator">&gt;&gt;&gt;</span>

<span class="org-haskell-operator">&gt;&gt;&gt;</span> <span class="org-haskell-type">Last</span> <span class="org-haskell-type">Nothing</span>
<span class="org-haskell-constructor">Last</span> {getLast <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Nothing</span>}
<span class="org-haskell-operator">&gt;&gt;&gt;</span> <span class="org-haskell-constructor">Last</span> (<span class="org-haskell-constructor">Just</span> 100)
<span class="org-haskell-constructor">Last</span> {getLast <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Just</span> 100}
<span class="org-haskell-operator">&gt;&gt;&gt;</span>

<span class="org-haskell-operator">&gt;&gt;&gt;</span> getLast <span class="org-haskell-operator">$</span> <span class="org-haskell-constructor">Last</span> (<span class="org-haskell-constructor">Just</span> 100)
<span class="org-haskell-constructor">Just</span> 100
<span class="org-haskell-operator">&gt;&gt;&gt;</span> getLast <span class="org-haskell-operator">$</span> <span class="org-haskell-constructor">Last</span> <span class="org-haskell-constructor">Nothing</span>
<span class="org-haskell-constructor">Nothing</span>
<span class="org-haskell-operator">&gt;&gt;&gt;</span>

<span class="org-haskell-operator">&gt;&gt;&gt;</span> <span class="org-haskell-constructor">Last</span> (<span class="org-haskell-constructor">Just</span> 10) <span class="org-haskell-operator">&lt;&gt;</span> <span class="org-haskell-constructor">Last</span> (<span class="org-haskell-constructor">Just</span> 100)
<span class="org-haskell-constructor">Last</span> {getLast <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Just</span> 100}
<span class="org-haskell-operator">&gt;&gt;&gt;</span>
<span class="org-haskell-operator">&gt;&gt;&gt;</span> <span class="org-haskell-constructor">Last</span> <span class="org-haskell-constructor">Nothing</span> <span class="org-haskell-operator">`mappend`</span> <span class="org-haskell-constructor">Last</span> (<span class="org-haskell-constructor">Just</span> 100)
<span class="org-haskell-constructor">Last</span> {getLast <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Just</span> 100}
<span class="org-haskell-operator">&gt;&gt;&gt;</span>
<span class="org-haskell-operator">&gt;&gt;&gt;</span> <span class="org-haskell-constructor">Last</span> (<span class="org-haskell-constructor">Just</span> 10) <span class="org-haskell-operator">&lt;&gt;</span> <span class="org-haskell-constructor">Last</span> <span class="org-haskell-constructor">Nothing</span>
<span class="org-haskell-constructor">Last</span> {getLast <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Just</span> 10}
<span class="org-haskell-operator">&gt;&gt;&gt;</span>
<span class="org-haskell-operator">&gt;&gt;&gt;</span> <span class="org-haskell-constructor">Last</span> <span class="org-haskell-constructor">Nothing</span> <span class="org-haskell-operator">&lt;&gt;</span> <span class="org-haskell-constructor">Last</span> (<span class="org-haskell-constructor">Just</span> 100)
<span class="org-haskell-constructor">Last</span> {getLast <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Just</span> 100}
<span class="org-haskell-operator">&gt;&gt;&gt;</span>
<span class="org-haskell-operator">&gt;&gt;&gt;</span> <span class="org-haskell-constructor">Last</span> <span class="org-haskell-constructor">Nothing</span> <span class="org-haskell-operator">&lt;&gt;</span> <span class="org-haskell-constructor">Last</span> <span class="org-haskell-constructor">Nothing</span>
<span class="org-haskell-constructor">Last</span> {getLast <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Nothing</span>}
<span class="org-haskell-operator">&gt;&gt;&gt;</span>

<span class="org-haskell-operator">&gt;&gt;&gt;</span> mconcat [<span class="org-haskell-constructor">Last</span> (<span class="org-haskell-constructor">Just</span> 10), <span class="org-haskell-constructor">Last</span> (<span class="org-haskell-constructor">Just</span> 2), <span class="org-haskell-constructor">Last</span> <span class="org-haskell-constructor">Nothing</span>, <span class="org-haskell-constructor">Last</span> (<span class="org-haskell-constructor">Just</span> 3)]
<span class="org-haskell-constructor">Last</span> {getLast <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Just</span> 3}
<span class="org-haskell-operator">&gt;&gt;&gt;</span>

<span class="org-haskell-operator">&gt;&gt;&gt;</span> mconcat [<span class="org-haskell-constructor">Last</span> (<span class="org-haskell-constructor">Just</span> 6),  <span class="org-haskell-constructor">Last</span> <span class="org-haskell-constructor">Nothing</span>, <span class="org-haskell-constructor">Last</span> (<span class="org-haskell-constructor">Just</span> 3)]
<span class="org-haskell-constructor">Last</span> {getLast <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Just</span> 3}
<span class="org-haskell-operator">&gt;&gt;&gt;</span>

<span class="org-haskell-operator">&gt;&gt;&gt;</span> mconcat [<span class="org-haskell-constructor">Last</span> (<span class="org-haskell-constructor">Just</span> 6),  <span class="org-haskell-constructor">Last</span> <span class="org-haskell-constructor">Nothing</span>]
<span class="org-haskell-constructor">Last</span> {getLast <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Just</span> 6}
<span class="org-haskell-operator">&gt;&gt;&gt;</span>

<span class="org-haskell-operator">&gt;&gt;&gt;</span> mconcat [<span class="org-haskell-constructor">Last</span> <span class="org-haskell-constructor">Nothing</span>]
<span class="org-haskell-constructor">Last</span> {getLast <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Nothing</span>}
<span class="org-haskell-operator">&gt;&gt;&gt;</span>
</pre>
</div>
</div>
</div>
