haskell/monoids.org
**** Endo 

Endo is a Monoid defined for endomorphism which means transformation
(a -> a) from a type to itself. 



| Function        |    | Signature                                   | Description                                  |
|-----------------+----+---------------------------------------------+----------------------------------------------|
| Monoid instance |    | newtype Endo a = Endo { appEndo :: a -> a } |                                              |
|                 |    |                                             |                                              |
| mempty          | :: | Endo id                                     | Identity element is identity function        |
| mappend         | :: | Endo a -> Endo a -> Endo a                  | Binary operation is function composition (.) |
| moncat          | :: | [Endo a] -> Endo a                          | Composition of all functions in a list       |
| <>              | :: | Endo a -> Endo a -> Endo a                  | Alias to mappend.                            |
|                 |    |                                             |                                              |


 - [[http://hackage.haskell.org/package/base-4.9.1.0/docs/src/Data.Monoid.html#Endo][Source Code]]

#+BEGIN_SRC haskell 
  -- | The monoid of endomorphisms under composition.
  newtype Endo a = Endo { appEndo :: a -> a }
                 deriving (Generic)

  instance Monoid (Endo a) where
          mempty = Endo id
          Endo f `mappend` Endo g = Endo (f . g)
                                    
#+END_SRC


Example:

#+BEGIN_SRC haskell 
  > import Data.Monoid
  >

  -- Check the types 
  --
  > :info Endo
  newtype Endo a = Endo {appEndo :: a -> a}
          -- Defined in ‘Data.Monoid’
  instance Monoid (Endo a) -- Defined in ‘Data.Monoid’
  > 
  > 


  > :t Endo
  Endo :: (a -> a) -> Endo a
  > 
  > :t appEndo
  appEndo :: Endo a -> a -> a
  > 

  -- Define test functions 
  -- 
  > let f1 x = 10 * x
  > let f2 x = 5 * x
  > let f3 x = x + 9
  > let f4 x = x - 7
  > 
  > let m = Endo f1 
  > :t m
  m :: Num a => Endo a
  > 
  > appEndo m 3
  30
  > f1 3
  30
  >


  -- Monoid Identity value 
  -- 

  > let m1 = mempty :: Num a => Endo a
  > :t m1
  m1 :: Num a => Endo a
  > app
  appEndo     appendFile
  > appEndo m1 3
  3
  > appEndo m1 100
  100
  > 


  -- It is just function composition.
  --
  > let a = Endo f1 <> Endo f2 
  > appEndo a 3
  150
  > f1 . f2 $ 3
  150
  > 
  > let b = Endo f1 <> Endo f2 <> Endo f3
  > :t b
  b :: Num a => Endo a
  > 
  > appEndo b 3
  600
  > f1 . f2 . f3 $ 3
  600
  > 
  > let flist = [f1, f2, f3, f4]
  > :t flist
  flist :: Num a => [a -> a]
  > 


  ---  Compose all functions in the list.
  --- 
  > let flist = [Endo f1, Endo f2, Endo f3, Endo f4]
  > :t flist
  flist :: Num a => [Endo a]
  > 
  > let mm = mconcat flist
  > :t mm
  mm :: Num a => Endo a
  > 
  > app
  appEndo     appendFile
  > appEndo mm 3
  250
  > f1 . f2 . f3 . f4 $ 3
  250
  > f1 $ f2 $ f3 $ f4 $ 3
  250
  > f1 ( f2 ( f3 ( f4  3 )))
  250
  > 


  > let mm2 = map Endo [f1, f2, f3, f4]
  > :t mm2
  mm2 :: Num a => [Endo a]
  > 
  > let mm2 = mconcat $ map Endo [f1, f2, f3, f4]
  > :t mm2
  mm2 :: Num a => Endo a
  > 
  > appEndo mm2 3
  250
  > map (appEndo mm2) [1, 2, 3, 4, 5]
  [150,200,250,300,350]
  > 

#+END_SRC

