haskell/monoids.html

<div id="outline-container-sec-1-1-2-8" class="outline-5">
<h5 id="sec-1-1-2-8"><span class="section-number-5">1.1.2.8</span> Endo</h5>
<div class="outline-text-5" id="text-1-1-2-8">
<p>
Endo is a Monoid defined for endomorphism which means transformation
(a -&gt; a) from a type to itself. 
</p>



<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">Function</th>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">Signature</th>
<th scope="col" class="left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">Monoid instance</td>
<td class="left">&#xa0;</td>
<td class="left">newtype Endo a = Endo { appEndo :: a -&gt; a }</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">mempty</td>
<td class="left">::</td>
<td class="left">Endo id</td>
<td class="left">Identity element is identity function</td>
</tr>

<tr>
<td class="left">mappend</td>
<td class="left">::</td>
<td class="left">Endo a -&gt; Endo a -&gt; Endo a</td>
<td class="left">Binary operation is function composition (.)</td>
</tr>

<tr>
<td class="left">moncat</td>
<td class="left">::</td>
<td class="left">[Endo a] -&gt; Endo a</td>
<td class="left">Composition of all functions in a list</td>
</tr>

<tr>
<td class="left">&lt;&gt;</td>
<td class="left">::</td>
<td class="left">Endo a -&gt; Endo a -&gt; Endo a</td>
<td class="left">Alias to mappend.</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
</table>


<ul class="org-ul">
<li><a href="http://hackage.haskell.org/package/base-4.9.1.0/docs/src/Data.Monoid.html#Endo">Source Code</a>
</li>
</ul>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-doc">-- | The monoid of endomorphisms under composition.</span>
<span class="org-haskell-keyword">newtype</span> <span class="org-haskell-type">Endo</span> a <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Endo</span> { appEndo <span class="org-haskell-operator">::</span> a <span class="org-haskell-operator">-&gt;</span> a }
               <span class="org-haskell-keyword">deriving</span> (<span class="org-haskell-constructor">Generic</span>)

<span class="org-haskell-keyword">instance</span> <span class="org-haskell-type">Monoid</span> (<span class="org-haskell-type">Endo</span> a) <span class="org-haskell-keyword">where</span>
        mempty <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Endo</span> id
        <span class="org-haskell-constructor">Endo</span> f <span class="org-haskell-operator">`mappend`</span> <span class="org-haskell-constructor">Endo</span> g <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Endo</span> (f <span class="org-haskell-operator">.</span> g)
</pre>
</div>


<p>
Example:
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">Data.Monoid</span>
<span class="org-haskell-operator">&gt;</span>

<span class="org-comment-delimiter">-- </span><span class="org-comment">Check the types </span>
<span class="org-comment-delimiter">--</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>info <span class="org-haskell-constructor">Endo</span>
<span class="org-haskell-keyword">newtype</span> <span class="org-haskell-type">Endo</span> a <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Endo</span> {appEndo <span class="org-haskell-operator">::</span> a <span class="org-haskell-operator">-&gt;</span> a}
        <span class="org-comment-delimiter">-- </span><span class="org-comment">Defined in &#8216;Data.Monoid&#8217;</span>
<span class="org-haskell-keyword">instance</span> <span class="org-haskell-type">Monoid</span> (<span class="org-haskell-type">Endo</span> a) <span class="org-comment-delimiter">-- </span><span class="org-comment">Defined in &#8216;Data.Monoid&#8217;</span>
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> 


<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-type">:</span>t <span class="org-haskell-type">Endo</span>
<span class="org-function-name">Endo</span> <span class="org-haskell-operator">::</span> (a <span class="org-haskell-operator">-&gt;</span> a) <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Endo</span> a
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-type">:</span>t appEndo
<span class="org-function-name">appEndo</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Endo</span> a <span class="org-haskell-operator">-&gt;</span> a <span class="org-haskell-operator">-&gt;</span> a
<span class="org-haskell-operator">&gt;</span> 

<span class="org-comment-delimiter">-- </span><span class="org-comment">Define test functions </span>
<span class="org-comment-delimiter">-- </span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">let</span> f1 x <span class="org-haskell-operator">=</span> 10 <span class="org-haskell-operator">*</span> x
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">let</span> f2 x <span class="org-haskell-operator">=</span> 5 <span class="org-haskell-operator">*</span> x
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">let</span> f3 x <span class="org-haskell-operator">=</span> x <span class="org-haskell-operator">+</span> 9
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">let</span> f4 x <span class="org-haskell-operator">=</span> x <span class="org-haskell-operator">-</span> 7
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">let</span> m <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Endo</span> f1 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>t m
<span class="org-function-name">m</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Num</span> a <span class="org-haskell-operator">=&gt;</span> <span class="org-haskell-type">Endo</span> a
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">appEndo</span> m 3
30
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">f1</span> 3
30
<span class="org-haskell-operator">&gt;</span>


<span class="org-comment-delimiter">-- </span><span class="org-comment">Monoid Identity value </span>
<span class="org-comment-delimiter">-- </span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">let</span> m1 <span class="org-haskell-operator">=</span> mempty <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Num</span> a <span class="org-haskell-operator">=&gt;</span> <span class="org-haskell-type">Endo</span> a
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-type">:</span>t m1
<span class="org-function-name">m1</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Num</span> a <span class="org-haskell-operator">=&gt;</span> <span class="org-haskell-type">Endo</span> a
<span class="org-haskell-operator">&gt;</span> app
<span class="org-haskell-definition">appEndo</span>     appendFile
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">appEndo</span> m1 3
3
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">appEndo</span> m1 100
100
<span class="org-haskell-operator">&gt;</span> 


<span class="org-comment-delimiter">-- </span><span class="org-comment">It is just function composition.</span>
<span class="org-comment-delimiter">--</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">let</span> a <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Endo</span> f1 <span class="org-haskell-operator">&lt;&gt;</span> <span class="org-haskell-constructor">Endo</span> f2 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">appEndo</span> a 3
150
<span class="org-haskell-operator">&gt;</span> f1 <span class="org-haskell-definition">.</span> f2 <span class="org-haskell-operator">$</span> 3
150
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">let</span> b <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Endo</span> f1 <span class="org-haskell-operator">&lt;&gt;</span> <span class="org-haskell-constructor">Endo</span> f2 <span class="org-haskell-operator">&lt;&gt;</span> <span class="org-haskell-constructor">Endo</span> f3
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>t b
<span class="org-function-name">b</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Num</span> a <span class="org-haskell-operator">=&gt;</span> <span class="org-haskell-type">Endo</span> a
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">appEndo</span> b 3
600
<span class="org-haskell-operator">&gt;</span> f1 <span class="org-haskell-definition">.</span> f2 <span class="org-haskell-operator">.</span> f3 <span class="org-haskell-operator">$</span> 3
600
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">let</span> flist <span class="org-haskell-operator">=</span> [f1, f2, f3, f4]
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>t flist
<span class="org-function-name">flist</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Num</span> a <span class="org-haskell-operator">=&gt;</span> [a <span class="org-haskell-operator">-&gt;</span> a]
<span class="org-haskell-operator">&gt;</span> 


<span class="org-comment-delimiter">--</span><span class="org-comment">-  Compose all functions in the list.</span>
<span class="org-comment-delimiter">--</span><span class="org-comment">- </span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">let</span> flist <span class="org-haskell-operator">=</span> [<span class="org-haskell-constructor">Endo</span> f1, <span class="org-haskell-constructor">Endo</span> f2, <span class="org-haskell-constructor">Endo</span> f3, <span class="org-haskell-constructor">Endo</span> f4]
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>t flist
<span class="org-function-name">flist</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Num</span> a <span class="org-haskell-operator">=&gt;</span> [<span class="org-haskell-type">Endo</span> a]
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">let</span> mm <span class="org-haskell-operator">=</span> mconcat flist
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>t mm
<span class="org-function-name">mm</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Num</span> a <span class="org-haskell-operator">=&gt;</span> <span class="org-haskell-type">Endo</span> a
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> app
<span class="org-haskell-definition">appEndo</span>     appendFile
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">appEndo</span> mm 3
250
<span class="org-haskell-operator">&gt;</span> f1 <span class="org-haskell-definition">.</span> f2 <span class="org-haskell-operator">.</span> f3 <span class="org-haskell-operator">.</span> f4 <span class="org-haskell-operator">$</span> 3
250
<span class="org-haskell-operator">&gt;</span> f1 <span class="org-haskell-definition">$</span> f2 <span class="org-haskell-operator">$</span> f3 <span class="org-haskell-operator">$</span> f4 <span class="org-haskell-operator">$</span> 3
250
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">f1</span> ( f2 ( f3 ( f4  3 )))
250
<span class="org-haskell-operator">&gt;</span> 


<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">let</span> mm2 <span class="org-haskell-operator">=</span> map <span class="org-haskell-constructor">Endo</span> [f1, f2, f3, f4]
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>t mm2
<span class="org-function-name">mm2</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Num</span> a <span class="org-haskell-operator">=&gt;</span> [<span class="org-haskell-type">Endo</span> a]
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">let</span> mm2 <span class="org-haskell-operator">=</span> mconcat <span class="org-haskell-operator">$</span> map <span class="org-haskell-constructor">Endo</span> [f1, f2, f3, f4]
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>t mm2
<span class="org-function-name">mm2</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Num</span> a <span class="org-haskell-operator">=&gt;</span> <span class="org-haskell-type">Endo</span> a
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">appEndo</span> mm2 3
250
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">map</span> (appEndo mm2) [1, 2, 3, 4, 5]
[150,200,250,300,350]
<span class="org-haskell-operator">&gt;</span>
</pre>
</div>
</div>
</div>
</div>
