haskell/monoids.org
*** References

 - Module:  [[https://hackage.haskell.org/package/base-4.8.2.0/docs/Data-Monoid.html][Data.Monoid]]


 - Source of Module: [[https://hackage.haskell.org/package/base-4.8.2.0/docs/src/Data.Monoid.html#Last][Data.Monoid]]


 - [[https://wiki.haskell.org/Monoid][Monoids - Haskell Wiki]]


 - http://www.scs.stanford.edu/14sp-cs240h/slides/phantoms.html


 - [[https://twdkz.wordpress.com/2013/05/31/data-analysis-with-monoids/][Data analysis with Monoids | twdkz]]


 - [[https://people.cs.kuleuven.be/~tom.schrijvers/Research/talks/lhug4.pdf][List and Other Monoids - Tom Schrijvers]]

 
 - [[http://debasishg.blogspot.com.br/2013/02/a-dsl-with-endo-monoids-for-free.html][Ruminations of a Programmer: A DSL with an Endo - monoids for free]]  (Scala) 


 - [[https://dzone.com/articles/dsl-endo-monoids-free][A DSL with an Endo - monoids for free - DZone Performance]]


 - [[http://repository.upenn.edu/cgi/viewcontent.cgi?article%3D1773&context%3Dcis_papers][Monoids: Theme and Variations (Functional Pearl)]] - or [[https://web.archive.org/web/20170320050543/http://repository.upenn.edu/cgi/viewcontent.cgi?article%3D1773&context%3Dcis_papers][Web archive]]

** Foldable 
*** Overview 

Foldable is a  class of data structures that can be folded to a
summary value. It is a generalization of fold. 

Module documentation: [[https://hackage.haskell.org/package/base-4.9.1.0/docs/Data-Foldable.html][Data.Foldable]]  


#+BEGIN_SRC haskell 
class Foldable t where
    fold :: Monoid m => t m -> m
    foldMap :: Monoid m => (a -> m) -> t a -> m
    foldr :: (a -> b -> b) -> b -> t a -> b
    foldr' :: (a -> b -> b) -> b -> t a -> b
    foldl :: (a -> b -> a) -> a -> t b -
    foldl' :: (a -> b -> a) -> a -> t b -> a
    foldr1 :: (a -> a -> a) -> t a -> a
    foldl1 :: (a -> a -> a) -> t a -> a
    ... ... ... 
#+END_SRC

A minimal implementation of type class Foldable must implement the
functions fold or foldMap.

 - Combine the elements of a structure using a monoid.

#+BEGIN_SRC haskell    
    fold :: Monoid m => t m -> m
    fold = foldMap id
#+END_SRC

 - Map each element of the structure to a monoid, and combine the results.
 
#+BEGIN_SRC haskell 
    foldMap :: Monoid m => (a -> m) -> t a -> m
    {-# INLINE foldMap #-}
    -- This INLINE allows more list functions to fuse. See Trac #9848.
    foldMap f = foldr (mappend . f) mempty
#+END_SRC

*** Instance of class foldable 
