haskell/monoids.html

<div id="outline-container-sec-1-1-3" class="outline-4">
<h4 id="sec-1-1-3"><span class="section-number-4">1.1.3</span> References</h4>
<div class="outline-text-4" id="text-1-1-3">
<ul class="org-ul">
<li>Module:  <a href="https://hackage.haskell.org/package/base-4.8.2.0/docs/Data-Monoid.html">Data.Monoid</a>
</li>
</ul>


<ul class="org-ul">
<li>Source of Module: <a href="https://hackage.haskell.org/package/base-4.8.2.0/docs/src/Data.Monoid.html#Last">Data.Monoid</a>
</li>
</ul>


<ul class="org-ul">
<li><a href="https://wiki.haskell.org/Monoid">Monoids - Haskell Wiki</a>
</li>
</ul>


<ul class="org-ul">
<li><a href="http://www.scs.stanford.edu/14sp-cs240h/slides/phantoms.html">http://www.scs.stanford.edu/14sp-cs240h/slides/phantoms.html</a>
</li>
</ul>


<ul class="org-ul">
<li><a href="https://twdkz.wordpress.com/2013/05/31/data-analysis-with-monoids/">Data analysis with Monoids | twdkz</a>
</li>
</ul>


<ul class="org-ul">
<li><a href="https://people.cs.kuleuven.be/~tom.schrijvers/Research/talks/lhug4.pdf">List and Other Monoids - Tom Schrijvers</a>
</li>
</ul>


<ul class="org-ul">
<li><a href="http://debasishg.blogspot.com.br/2013/02/a-dsl-with-endo-monoids-for-free.html">Ruminations of a Programmer: A DSL with an Endo - monoids for free</a>  (Scala) 
</li>
</ul>


<ul class="org-ul">
<li><a href="https://dzone.com/articles/dsl-endo-monoids-free">A DSL with an Endo - monoids for free - DZone Performance</a>
</li>
</ul>


<ul class="org-ul">
<li><a href="http://repository.upenn.edu/cgi/viewcontent.cgi?article=1773&context=cis_papers">Monoids: Theme and Variations (Functional Pearl)</a> - or <a href="https://web.archive.org/web/20170320050543/http://repository.upenn.edu/cgi/viewcontent.cgi?article=1773&context=cis_papers">Web archive</a>
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Foldable</h3>
<div class="outline-text-3" id="text-1-2">
</div><div id="outline-container-sec-1-2-1" class="outline-4">
<h4 id="sec-1-2-1"><span class="section-number-4">1.2.1</span> Overview</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
Foldable is a  class of data structures that can be folded to a
summary value. It is a generalization of fold. 
</p>

<p>
Module documentation: <a href="https://hackage.haskell.org/package/base-4.9.1.0/docs/Data-Foldable.html">Data.Foldable</a>  
</p>


<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-keyword">class</span> <span class="org-haskell-type">Foldable</span> t <span class="org-haskell-keyword">where</span>
    fold <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Monoid</span> m <span class="org-haskell-operator">=&gt;</span> t m <span class="org-haskell-operator">-&gt;</span> m
    foldMap <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Monoid</span> m <span class="org-haskell-operator">=&gt;</span> (a <span class="org-haskell-operator">-&gt;</span> m) <span class="org-haskell-operator">-&gt;</span> t a <span class="org-haskell-operator">-&gt;</span> m
    foldr <span class="org-haskell-operator">::</span> (a <span class="org-haskell-operator">-&gt;</span> b <span class="org-haskell-operator">-&gt;</span> b) <span class="org-haskell-operator">-&gt;</span> b <span class="org-haskell-operator">-&gt;</span> t a <span class="org-haskell-operator">-&gt;</span> b
    foldr' <span class="org-haskell-operator">::</span> (a <span class="org-haskell-operator">-&gt;</span> b <span class="org-haskell-operator">-&gt;</span> b) <span class="org-haskell-operator">-&gt;</span> b <span class="org-haskell-operator">-&gt;</span> t a <span class="org-haskell-operator">-&gt;</span> b
    foldl <span class="org-haskell-operator">::</span> (a <span class="org-haskell-operator">-&gt;</span> b <span class="org-haskell-operator">-&gt;</span> a) <span class="org-haskell-operator">-&gt;</span> a <span class="org-haskell-operator">-&gt;</span> t b <span class="org-haskell-operator">-</span>
    foldl' <span class="org-haskell-operator">::</span> (a <span class="org-haskell-operator">-&gt;</span> b <span class="org-haskell-operator">-&gt;</span> a) <span class="org-haskell-operator">-&gt;</span> a <span class="org-haskell-operator">-&gt;</span> t b <span class="org-haskell-operator">-&gt;</span> a
    foldr1 <span class="org-haskell-operator">::</span> (a <span class="org-haskell-operator">-&gt;</span> a <span class="org-haskell-operator">-&gt;</span> a) <span class="org-haskell-operator">-&gt;</span> t a <span class="org-haskell-operator">-&gt;</span> a
    foldl1 <span class="org-haskell-operator">::</span> (a <span class="org-haskell-operator">-&gt;</span> a <span class="org-haskell-operator">-&gt;</span> a) <span class="org-haskell-operator">-&gt;</span> t a <span class="org-haskell-operator">-&gt;</span> a
    <span class="org-haskell-operator">...</span> <span class="org-haskell-operator">...</span> <span class="org-haskell-operator">...</span>
</pre>
</div>

<p>
A minimal implementation of type class Foldable must implement the
functions fold or foldMap.
</p>

<ul class="org-ul">
<li>Combine the elements of a structure using a monoid.
</li>
</ul>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-function-name">fold</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Monoid</span> m <span class="org-haskell-operator">=&gt;</span> t m <span class="org-haskell-operator">-&gt;</span> m
<span class="org-haskell-definition">fold</span> <span class="org-haskell-operator">=</span> foldMap id
</pre>
</div>

<ul class="org-ul">
<li>Map each element of the structure to a monoid, and combine the results.
</li>
</ul>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-function-name">foldMap</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Monoid</span> m <span class="org-haskell-operator">=&gt;</span> (a <span class="org-haskell-operator">-&gt;</span> m) <span class="org-haskell-operator">-&gt;</span> t a <span class="org-haskell-operator">-&gt;</span> m
<span class="org-haskell-pragma">{-# INLINE foldMap #-}</span>
<span class="org-comment-delimiter">-- </span><span class="org-comment">This INLINE allows more list functions to fuse. See Trac #9848.</span>
<span class="org-haskell-definition">foldMap</span> f <span class="org-haskell-operator">=</span> foldr (mappend <span class="org-haskell-operator">.</span> f) mempty
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-2-2" class="outline-4">
<h4 id="sec-1-2-2"><span class="section-number-4">1.2.2</span> Instance of class foldable</h4>
