haskell/monoids.html
<div class="outline-text-4" id="text-1-2-2">
</div><div id="outline-container-sec-1-2-2-1" class="outline-5">
<h5 id="sec-1-2-2-1"><span class="section-number-5">1.2.2.1</span> Get all Foldable instances</h5>
<div class="outline-text-5" id="text-1-2-2-1">
<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">Data.Foldable</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>info <span class="org-haskell-constructor">Foldable</span>

<span class="org-haskell-keyword">class</span> <span class="org-haskell-type">Foldable</span> (t <span class="org-haskell-operator">::</span> <span class="org-haskell-operator">*</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-operator">*</span>) <span class="org-haskell-keyword">where</span>
  fold <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Monoid</span> m <span class="org-haskell-operator">=&gt;</span> t m <span class="org-haskell-operator">-&gt;</span> m
  foldMap <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Monoid</span> m <span class="org-haskell-operator">=&gt;</span> (a <span class="org-haskell-operator">-&gt;</span> m) <span class="org-haskell-operator">-&gt;</span> t a <span class="org-haskell-operator">-&gt;</span> m
  foldr <span class="org-haskell-operator">::</span> (a <span class="org-haskell-operator">-&gt;</span> b <span class="org-haskell-operator">-&gt;</span> b) <span class="org-haskell-operator">-&gt;</span> b <span class="org-haskell-operator">-&gt;</span> t a <span class="org-haskell-operator">-&gt;</span> b
  foldr' <span class="org-haskell-operator">::</span> (a <span class="org-haskell-operator">-&gt;</span> b <span class="org-haskell-operator">-&gt;</span> b) <span class="org-haskell-operator">-&gt;</span> b <span class="org-haskell-operator">-&gt;</span> t a <span class="org-haskell-operator">-&gt;</span> b
  foldl <span class="org-haskell-operator">::</span> (b <span class="org-haskell-operator">-&gt;</span> a <span class="org-haskell-operator">-&gt;</span> b) <span class="org-haskell-operator">-&gt;</span> b <span class="org-haskell-operator">-&gt;</span> t a <span class="org-haskell-operator">-&gt;</span> b
  foldl' <span class="org-haskell-operator">::</span> (b <span class="org-haskell-operator">-&gt;</span> a <span class="org-haskell-operator">-&gt;</span> b) <span class="org-haskell-operator">-&gt;</span> b <span class="org-haskell-operator">-&gt;</span> t a <span class="org-haskell-operator">-&gt;</span> b
  foldr1 <span class="org-haskell-operator">::</span> (a <span class="org-haskell-operator">-&gt;</span> a <span class="org-haskell-operator">-&gt;</span> a) <span class="org-haskell-operator">-&gt;</span> t a <span class="org-haskell-operator">-&gt;</span> a
  foldl1 <span class="org-haskell-operator">::</span> (a <span class="org-haskell-operator">-&gt;</span> a <span class="org-haskell-operator">-&gt;</span> a) <span class="org-haskell-operator">-&gt;</span> t a <span class="org-haskell-operator">-&gt;</span> a
  toList <span class="org-haskell-operator">::</span> t a <span class="org-haskell-operator">-&gt;</span> [a]
  null <span class="org-haskell-operator">::</span> t a <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Bool</span>
  length <span class="org-haskell-operator">::</span> t a <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Int</span>
  elem <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Eq</span> a <span class="org-haskell-operator">=&gt;</span> a <span class="org-haskell-operator">-&gt;</span> t a <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Bool</span>
  maximum <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Ord</span> a <span class="org-haskell-operator">=&gt;</span> t a <span class="org-haskell-operator">-&gt;</span> a
  minimum <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Ord</span> a <span class="org-haskell-operator">=&gt;</span> t a <span class="org-haskell-operator">-&gt;</span> a
  sum <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Num</span> a <span class="org-haskell-operator">=&gt;</span> t a <span class="org-haskell-operator">-&gt;</span> a
  product <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Num</span> a <span class="org-haskell-operator">=&gt;</span> t a <span class="org-haskell-operator">-&gt;</span> a
  <span class="org-haskell-pragma">{-# MINIMAL foldMap | foldr #-}</span>

        <span class="org-comment-delimiter">-- </span><span class="org-comment">Defined in &#8216;Data.Foldable&#8217;</span>
<span class="org-haskell-keyword">instance</span> <span class="org-haskell-type">Foldable</span> <span class="org-haskell-constructor">[]</span> <span class="org-comment-delimiter">-- </span><span class="org-comment">Defined in &#8216;Data.Foldable&#8217;</span>
<span class="org-haskell-keyword">instance</span> <span class="org-haskell-type">Foldable</span> <span class="org-haskell-type">Sum</span> <span class="org-comment-delimiter">-- </span><span class="org-comment">Defined in &#8216;Data.Foldable&#8217;</span>
<span class="org-haskell-keyword">instance</span> <span class="org-haskell-type">Foldable</span> <span class="org-haskell-type">Product</span> <span class="org-comment-delimiter">-- </span><span class="org-comment">Defined in &#8216;Data.Foldable&#8217;</span>
<span class="org-haskell-keyword">instance</span> <span class="org-haskell-type">Foldable</span> <span class="org-haskell-type">Maybe</span> <span class="org-comment-delimiter">-- </span><span class="org-comment">Defined in &#8216;Data.Foldable&#8217;</span>
<span class="org-haskell-keyword">instance</span> <span class="org-haskell-type">Foldable</span> <span class="org-haskell-type">Last</span> <span class="org-comment-delimiter">-- </span><span class="org-comment">Defined in &#8216;Data.Foldable&#8217;</span>
<span class="org-haskell-keyword">instance</span> <span class="org-haskell-type">Foldable</span> <span class="org-haskell-type">First</span> <span class="org-comment-delimiter">-- </span><span class="org-comment">Defined in &#8216;Data.Foldable&#8217;</span>
<span class="org-haskell-keyword">instance</span> <span class="org-haskell-type">Foldable</span> (<span class="org-haskell-type">Either</span> a) <span class="org-comment-delimiter">-- </span><span class="org-comment">Defined in &#8216;Data.Foldable&#8217;</span>
<span class="org-haskell-keyword">instance</span> <span class="org-haskell-type">Foldable</span> <span class="org-haskell-type">Dual</span> <span class="org-comment-delimiter">-- </span><span class="org-comment">Defined in &#8216;Data.Foldable&#8217;</span>
<span class="org-haskell-keyword">instance</span> <span class="org-haskell-type">Foldable</span> (<span class="org-haskell-constructor">(,)</span> a) <span class="org-comment-delimiter">-- </span><span class="org-comment">Defined in &#8216;Data.Foldable&#8217;</span>
<span class="org-haskell-operator">&gt;</span>
</pre>
</div>
</div>
</div>
