haskell/monoids.org
**** List 

#+BEGIN_SRC haskell 
instance Foldable [] where
    foldMap _ [] = mempty
    foldMap f (x : xs) = f x <> foldMap xs
#+END_SRC


Example 1: Foldable list and list monoid 

#+BEGIN_SRC haskell 
  > import Data.Foldable
  >

  -- For lists - Data.Foldable.fold is equivalent to concat 
  --
  -- fold :: [[a]] -> [a]
  -- 
  > :t fold
  fold :: (Monoid m, Foldable t) => t m -> m
  > 

  > fold [[1, 10, 30], [1, 2, 3, 4, 5], [], [3, 4]]
  [1,10,30,1,2,3,4,5,3,4]
  > 

  > concat [[1, 10, 30], [1, 2, 3, 4, 5], [], [3, 4]]
  [1,10,30,1,2,3,4,5,3,4]
  > 


  -- Lazy letf fold -> Can cause memory leak 
  --
  > foldl (\acc x -> 10 * acc + x) 0 [1, 2, 3, 4, 5]
  12345
  > 

  -- Strict left fold
  --
  > foldl' (\acc x -> 10 * acc + x) 0 [1, 2, 3, 4, 5]
  12345
  > 

  -- Right fold 
  --
  > 
  > :t foldr
  foldr :: Foldable t => (a -> b -> b) -> b -> t a -> b
  > 
  > foldr (\x acc -> 10 * acc + x) 0 [1, 2, 3, 4, 5]
  54321

  -- foldMap - Equivalent to map and concat for list.
  --
  -- For lists:
  --  foldMap :: (a -> [a]) -> [a] -> [a]
  -- 
  > :t foldMap 
  foldMap :: (Monoid m, Foldable t) => (a -> m) -> t a -> m
  > 

  > foldMap (\x -> [2 * x, 3 * x, 5 * x]) [1, 2, 3, 4, 5]
  [2,3,5,4,6,10,6,9,15,8,12,20,10,15,25]
  > 

  > 
  > map (\x -> [2 * x, 3 * x, 5 * x]) [1, 2, 3, 4, 5]
  [[2,3,5],[4,6,10],[6,9,15],[8,12,20],[10,15,25]]
  > 
  > concat $ map (\x -> [2 * x, 3 * x, 5 * x]) [1, 2, 3, 4, 5]
  [2,3,5,4,6,10,6,9,15,8,12,20,10,15,25]
  > 

#+END_SRC


Example 2: Foldable list and string monoid 

#+BEGIN_SRC haskell 
  > import Data.Monoid
  > import Data.Foldable 
  > 

  > mempty :: String
  ""
  > "hello " <> " world " <> " Haskell "
  "hello  world  Haskell "
  > 


  --
  -- fold :: [String] -> String
  --
  > :t fold
  fold :: (Monoid m, Foldable t) => t m -> m
  >

  > fold ["hello ",  " world ", " Haskell "]
  "hello  world  Haskell "
  > 

  -- 
  -- foldMap :: (a -> String) -> [String] -> String
  --
  > :t foldMap 
  foldMap :: (Monoid m, Foldable t) => (a -> m) -> t a -> m
  >
   
  > foldMap (\x -> " x = " ++ show x ++ ", ") [1, 2, 3, 4, 5]
  " x = 1,  x = 2,  x = 3,  x = 4,  x = 5, "
  > 

#+END_SRC

Example 3: Foldable list and sum monoid 

#+BEGIN_SRC haskell 
  > import Data.Monoid
  > import Data.Foldable as DF
  > 

  --
  -- fold :: [Sum a] -> Sum a 
  --
  > :t fold
  fold :: (Monoid m, Foldable t) => t m -> m
  >

  > fold [Sum 3, Sum 10, Sum 6, Sum 10]
  Sum {getSum = 29}
  > 
  > getSum $ fold [Sum 3, Sum 10, Sum 6, Sum 10]
  29
  > 


  -- 
  -- foldMap :: (a -> Sum a) -> [a] -> Sum a 
  --
  > :t foldMap 
  DF.foldMap :: (Monoid m, Foldable t) => (a -> m) -> t a -> m
  >

  > 
  > foldMap Sum [1, 2, 3, 4, 5]
  Sum {getSum = 15}
  > 
  > getSum $ foldMap Sum [1, 2, 3, 4, 5]
  15
  > 

#+END_SRC

Example 4: Foldable list and Endo monoid 

#+BEGIN_SRC haskell
  > import Data.Monoid
  > import Data.Foldable
  > 

  > :t Endo
  Endo :: (a -> a) -> Endo a
  >

  -- Composes all functions wrapped by Endo 
  -- 
  -- fold :: [Endo a] -> Endo a 
  --
  --
  > :t fold
  fold :: (Monoid m, Foldable t) => t m -> m
  >


  > let m = fold [Endo (+10), Endo (*3), Endo $ \x -> 10 * x - 5] :: Endo Int

  > :t m
  m :: Endo Int

  > appEndo m 5
  145

  > appEndo m 4
  115
  > 

   -- Equivalent expressions 

  > (+10) . (*3) . (\x -> 10 * x - 5) $ 5 :: Int
  145
  > (+10) . (*3) . (\x -> 10 * x - 5) $ 5 
  145
  > (+10) . (*3) . (\x -> 10 * x - 5) $ 5 :: Int
  145
  > (+10) . (*3) . (\x -> 10 * x - 5) $ 4 :: Int
  115
  > (+10) $ (*3) $ (\x -> 10 * x - 5) $ 4 :: Int
  115
  > 


  --------------------------------------------------------
  --
  -- foldMap :: (a -> Endo a) -> [Endo a] -> Endo a
  --
  > :t foldMap 
  foldMap :: (Monoid m, Foldable t) => (a -> m) -> t a -> m
  >

  > let f = foldMap Endo [ (+10),  (*3),  \x -> 10 * x - 5] 
  > :t f
  f :: Num a => Endo a
  > 
  > appEndo f 4
  115
  > appEndo f 5
  145
  > 

  > let f2 = foldMap (\f -> Endo $ \x -> f (3 * x - 2))  [ (+10),  (*3),  \x -> 10 * x - 5] 

  > appEndo f2 4
  2555
  > appEndo f2 5
  3365

  > let f3 = fold $ map  (\f -> Endo $ \x -> f (3 * x - 2))  [ (+10),  (*3),  \x -> 10 * x - 5] 
  > :t f3
  f3 :: Num a => Endo a
  > appEndo f3 4
  2555
  > appEndo f3 5
  3365
  > 

#+END_SRC

