haskell/monoids.html

<div id="outline-container-sec-1-2-2-2" class="outline-5">
<h5 id="sec-1-2-2-2"><span class="section-number-5">1.2.2.2</span> List</h5>
<div class="outline-text-5" id="text-1-2-2-2">
<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-keyword">instance</span> <span class="org-haskell-type">Foldable</span> <span class="org-haskell-constructor">[]</span> <span class="org-haskell-keyword">where</span>
    foldMap <span class="org-haskell-keyword">_</span> <span class="org-haskell-constructor">[]</span> <span class="org-haskell-operator">=</span> mempty
    foldMap f (x <span class="org-haskell-constructor">:</span> xs) <span class="org-haskell-operator">=</span> f x <span class="org-haskell-operator">&lt;&gt;</span> foldMap xs
</pre>
</div>


<p>
Example 1: Foldable list and list monoid 
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">Data.Foldable</span>
<span class="org-haskell-operator">&gt;</span>

<span class="org-comment-delimiter">-- </span><span class="org-comment">For lists - Data.Foldable.fold is equivalent to concat </span>
<span class="org-comment-delimiter">--</span>
<span class="org-comment-delimiter">-- </span><span class="org-comment">fold :: [[a]] -&gt; [a]</span>
<span class="org-comment-delimiter">-- </span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>t fold
<span class="org-function-name">fold</span> <span class="org-haskell-operator">::</span> (<span class="org-haskell-type">Monoid</span> m, <span class="org-haskell-type">Foldable</span> t) <span class="org-haskell-operator">=&gt;</span> t m <span class="org-haskell-operator">-&gt;</span> m
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">fold</span> [[1, 10, 30], [1, 2, 3, 4, 5], <span class="org-haskell-constructor">[]</span>, [3, 4]]
[1,10,30,1,2,3,4,5,3,4]
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">concat</span> [[1, 10, 30], [1, 2, 3, 4, 5], <span class="org-haskell-constructor">[]</span>, [3, 4]]
[1,10,30,1,2,3,4,5,3,4]
<span class="org-haskell-operator">&gt;</span> 


<span class="org-comment-delimiter">-- </span><span class="org-comment">Lazy letf fold -&gt; Can cause memory leak </span>
<span class="org-comment-delimiter">--</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">foldl</span> (<span class="org-haskell-operator">\</span>acc x <span class="org-haskell-operator">-&gt;</span> 10 <span class="org-haskell-operator">*</span> acc <span class="org-haskell-operator">+</span> x) 0 [1, 2, 3, 4, 5]
12345
<span class="org-haskell-operator">&gt;</span> 

<span class="org-comment-delimiter">-- </span><span class="org-comment">Strict left fold</span>
<span class="org-comment-delimiter">--</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">foldl'</span> (<span class="org-haskell-operator">\</span>acc x <span class="org-haskell-operator">-&gt;</span> 10 <span class="org-haskell-operator">*</span> acc <span class="org-haskell-operator">+</span> x) 0 [1, 2, 3, 4, 5]
12345
<span class="org-haskell-operator">&gt;</span> 

<span class="org-comment-delimiter">-- </span><span class="org-comment">Right fold </span>
<span class="org-comment-delimiter">--</span>
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>t foldr
<span class="org-function-name">foldr</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Foldable</span> t <span class="org-haskell-operator">=&gt;</span> (a <span class="org-haskell-operator">-&gt;</span> b <span class="org-haskell-operator">-&gt;</span> b) <span class="org-haskell-operator">-&gt;</span> b <span class="org-haskell-operator">-&gt;</span> t a <span class="org-haskell-operator">-&gt;</span> b
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">foldr</span> (<span class="org-haskell-operator">\</span>x acc <span class="org-haskell-operator">-&gt;</span> 10 <span class="org-haskell-operator">*</span> acc <span class="org-haskell-operator">+</span> x) 0 [1, 2, 3, 4, 5]
54321

<span class="org-comment-delimiter">-- </span><span class="org-comment">foldMap - Equivalent to map and concat for list.</span>
<span class="org-comment-delimiter">--</span>
<span class="org-comment-delimiter">-- </span><span class="org-comment">For lists:</span>
<span class="org-comment-delimiter">--  </span><span class="org-comment">foldMap :: (a -&gt; [a]) -&gt; [a] -&gt; [a]</span>
<span class="org-comment-delimiter">-- </span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>t foldMap 
<span class="org-function-name">foldMap</span> <span class="org-haskell-operator">::</span> (<span class="org-haskell-type">Monoid</span> m, <span class="org-haskell-type">Foldable</span> t) <span class="org-haskell-operator">=&gt;</span> (a <span class="org-haskell-operator">-&gt;</span> m) <span class="org-haskell-operator">-&gt;</span> t a <span class="org-haskell-operator">-&gt;</span> m
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">foldMap</span> (<span class="org-haskell-operator">\</span>x <span class="org-haskell-operator">-&gt;</span> [2 <span class="org-haskell-operator">*</span> x, 3 <span class="org-haskell-operator">*</span> x, 5 <span class="org-haskell-operator">*</span> x]) [1, 2, 3, 4, 5]
[2,3,5,4,6,10,6,9,15,8,12,20,10,15,25]
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">map</span> (<span class="org-haskell-operator">\</span>x <span class="org-haskell-operator">-&gt;</span> [2 <span class="org-haskell-operator">*</span> x, 3 <span class="org-haskell-operator">*</span> x, 5 <span class="org-haskell-operator">*</span> x]) [1, 2, 3, 4, 5]
[[2,3,5],[4,6,10],[6,9,15],[8,12,20],[10,15,25]]
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> concat <span class="org-haskell-definition">$</span> map (<span class="org-haskell-operator">\</span>x <span class="org-haskell-operator">-&gt;</span> [2 <span class="org-haskell-operator">*</span> x, 3 <span class="org-haskell-operator">*</span> x, 5 <span class="org-haskell-operator">*</span> x]) [1, 2, 3, 4, 5]
[2,3,5,4,6,10,6,9,15,8,12,20,10,15,25]
<span class="org-haskell-operator">&gt;</span>
</pre>
</div>


<p>
Example 2: Foldable list and string monoid 
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">Data.Monoid</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">Data.Foldable</span> 
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">mempty</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">String</span>
<span class="org-string">""</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-string">"hello "</span> <span class="org-haskell-operator">&lt;&gt;</span> <span class="org-string">" world "</span> <span class="org-haskell-operator">&lt;&gt;</span> <span class="org-string">" Haskell "</span>
<span class="org-string">"hello  world  Haskell "</span>
<span class="org-haskell-operator">&gt;</span> 


<span class="org-comment-delimiter">--</span>
<span class="org-comment-delimiter">-- </span><span class="org-comment">fold :: [String] -&gt; String</span>
<span class="org-comment-delimiter">--</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>t fold
<span class="org-function-name">fold</span> <span class="org-haskell-operator">::</span> (<span class="org-haskell-type">Monoid</span> m, <span class="org-haskell-type">Foldable</span> t) <span class="org-haskell-operator">=&gt;</span> t m <span class="org-haskell-operator">-&gt;</span> m
<span class="org-haskell-operator">&gt;</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">fold</span> [<span class="org-string">"hello "</span>,  <span class="org-string">" world "</span>, <span class="org-string">" Haskell "</span>]
<span class="org-string">"hello  world  Haskell "</span>
<span class="org-haskell-operator">&gt;</span> 

<span class="org-comment-delimiter">-- </span>
<span class="org-comment-delimiter">-- </span><span class="org-comment">foldMap :: (a -&gt; String) -&gt; [String] -&gt; String</span>
<span class="org-comment-delimiter">--</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>t foldMap 
<span class="org-function-name">foldMap</span> <span class="org-haskell-operator">::</span> (<span class="org-haskell-type">Monoid</span> m, <span class="org-haskell-type">Foldable</span> t) <span class="org-haskell-operator">=&gt;</span> (a <span class="org-haskell-operator">-&gt;</span> m) <span class="org-haskell-operator">-&gt;</span> t a <span class="org-haskell-operator">-&gt;</span> m
<span class="org-haskell-operator">&gt;</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">foldMap</span> (<span class="org-haskell-operator">\</span>x <span class="org-haskell-operator">-&gt;</span> <span class="org-string">" x = "</span> <span class="org-haskell-operator">++</span> show x <span class="org-haskell-operator">++</span> <span class="org-string">", "</span>) [1, 2, 3, 4, 5]
<span class="org-string">" x = 1,  x = 2,  x = 3,  x = 4,  x = 5, "</span>
<span class="org-haskell-operator">&gt;</span>
</pre>
</div>

<p>
Example 3: Foldable list and sum monoid 
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">Data.Monoid</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">Data.Foldable</span> <span class="org-haskell-keyword">as</span> <span class="org-haskell-constructor">DF</span>
<span class="org-haskell-operator">&gt;</span> 

<span class="org-comment-delimiter">--</span>
<span class="org-comment-delimiter">-- </span><span class="org-comment">fold :: [Sum a] -&gt; Sum a </span>
<span class="org-comment-delimiter">--</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>t fold
<span class="org-function-name">fold</span> <span class="org-haskell-operator">::</span> (<span class="org-haskell-type">Monoid</span> m, <span class="org-haskell-type">Foldable</span> t) <span class="org-haskell-operator">=&gt;</span> t m <span class="org-haskell-operator">-&gt;</span> m
<span class="org-haskell-operator">&gt;</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">fold</span> [<span class="org-haskell-type">Sum</span> 3, <span class="org-haskell-type">Sum</span> 10, <span class="org-haskell-type">Sum</span> 6, <span class="org-haskell-type">Sum</span> 10]
<span class="org-haskell-constructor">Sum</span> {getSum <span class="org-haskell-operator">=</span> 29}
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> getSum <span class="org-haskell-definition">$</span> fold [<span class="org-haskell-constructor">Sum</span> 3, <span class="org-haskell-constructor">Sum</span> 10, <span class="org-haskell-constructor">Sum</span> 6, <span class="org-haskell-constructor">Sum</span> 10]
29
<span class="org-haskell-operator">&gt;</span> 


<span class="org-comment-delimiter">-- </span>
<span class="org-comment-delimiter">-- </span><span class="org-comment">foldMap :: (a -&gt; Sum a) -&gt; [a] -&gt; Sum a </span>
<span class="org-comment-delimiter">--</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>t foldMap 
<span class="org-function-name">DF.foldMap</span> <span class="org-haskell-operator">::</span> (<span class="org-haskell-type">Monoid</span> m, <span class="org-haskell-type">Foldable</span> t) <span class="org-haskell-operator">=&gt;</span> (a <span class="org-haskell-operator">-&gt;</span> m) <span class="org-haskell-operator">-&gt;</span> t a <span class="org-haskell-operator">-&gt;</span> m
<span class="org-haskell-operator">&gt;</span>

<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">foldMap</span> <span class="org-haskell-type">Sum</span> [1, 2, 3, 4, 5]
<span class="org-haskell-constructor">Sum</span> {getSum <span class="org-haskell-operator">=</span> 15}
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> getSum <span class="org-haskell-definition">$</span> foldMap <span class="org-haskell-constructor">Sum</span> [1, 2, 3, 4, 5]
15
<span class="org-haskell-operator">&gt;</span>
</pre>
</div>

<p>
Example 4: Foldable list and Endo monoid 
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">Data.Monoid</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">Data.Foldable</span>
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>t <span class="org-haskell-constructor">Endo</span>
<span class="org-function-name">Endo</span> <span class="org-haskell-operator">::</span> (a <span class="org-haskell-operator">-&gt;</span> a) <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Endo</span> a
<span class="org-haskell-operator">&gt;</span>

<span class="org-comment-delimiter">-- </span><span class="org-comment">Composes all functions wrapped by Endo </span>
<span class="org-comment-delimiter">-- </span>
<span class="org-comment-delimiter">-- </span><span class="org-comment">fold :: [Endo a] -&gt; Endo a </span>
<span class="org-comment-delimiter">--</span>
<span class="org-comment-delimiter">--</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-type">:</span>t fold
<span class="org-function-name">fold</span> <span class="org-haskell-operator">::</span> (<span class="org-haskell-type">Monoid</span> m, <span class="org-haskell-type">Foldable</span> t) <span class="org-haskell-operator">=&gt;</span> t m <span class="org-haskell-operator">-&gt;</span> m
<span class="org-haskell-operator">&gt;</span>


<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">let</span> m <span class="org-haskell-operator">=</span> fold [<span class="org-haskell-constructor">Endo</span> (<span class="org-haskell-operator">+</span>10), <span class="org-haskell-constructor">Endo</span> (<span class="org-haskell-operator">*</span>3), <span class="org-haskell-constructor">Endo</span> <span class="org-haskell-operator">$</span> <span class="org-haskell-operator">\</span>x <span class="org-haskell-operator">-&gt;</span> 10 <span class="org-haskell-operator">*</span> x <span class="org-haskell-operator">-</span> 5] <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Endo</span> <span class="org-haskell-type">Int</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-type">:</span>t m
<span class="org-function-name">m</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Endo</span> <span class="org-haskell-type">Int</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">appEndo</span> m 5
145

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">appEndo</span> m 4
115
<span class="org-haskell-operator">&gt;</span> 

 <span class="org-comment-delimiter">-- </span><span class="org-comment">Equivalent expressions </span>

<span class="org-haskell-operator">&gt;</span> (<span class="org-haskell-operator">+</span>10) <span class="org-haskell-operator">.</span> (<span class="org-haskell-operator">*</span>3) <span class="org-haskell-operator">.</span> (<span class="org-haskell-operator">\</span>x <span class="org-haskell-operator">-&gt;</span> 10 <span class="org-haskell-operator">*</span> x <span class="org-haskell-operator">-</span> 5) <span class="org-haskell-operator">$</span> 5 <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Int</span>
145
<span class="org-haskell-operator">&gt;</span> (<span class="org-haskell-operator">+</span>10) <span class="org-haskell-operator">.</span> (<span class="org-haskell-operator">*</span>3) <span class="org-haskell-operator">.</span> (<span class="org-haskell-operator">\</span>x <span class="org-haskell-operator">-&gt;</span> 10 <span class="org-haskell-operator">*</span> x <span class="org-haskell-operator">-</span> 5) <span class="org-haskell-operator">$</span> 5 
145
<span class="org-haskell-operator">&gt;</span> (<span class="org-haskell-operator">+</span>10) <span class="org-haskell-operator">.</span> (<span class="org-haskell-operator">*</span>3) <span class="org-haskell-operator">.</span> (<span class="org-haskell-operator">\</span>x <span class="org-haskell-operator">-&gt;</span> 10 <span class="org-haskell-operator">*</span> x <span class="org-haskell-operator">-</span> 5) <span class="org-haskell-operator">$</span> 5 <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Int</span>
145
<span class="org-haskell-operator">&gt;</span> (<span class="org-haskell-operator">+</span>10) <span class="org-haskell-operator">.</span> (<span class="org-haskell-operator">*</span>3) <span class="org-haskell-operator">.</span> (<span class="org-haskell-operator">\</span>x <span class="org-haskell-operator">-&gt;</span> 10 <span class="org-haskell-operator">*</span> x <span class="org-haskell-operator">-</span> 5) <span class="org-haskell-operator">$</span> 4 <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Int</span>
115
<span class="org-haskell-operator">&gt;</span> (<span class="org-haskell-operator">+</span>10) <span class="org-haskell-operator">$</span> (<span class="org-haskell-operator">*</span>3) <span class="org-haskell-operator">$</span> (<span class="org-haskell-operator">\</span>x <span class="org-haskell-operator">-&gt;</span> 10 <span class="org-haskell-operator">*</span> x <span class="org-haskell-operator">-</span> 5) <span class="org-haskell-operator">$</span> 4 <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Int</span>
115
<span class="org-haskell-operator">&gt;</span> 


<span class="org-comment-delimiter">--</span><span class="org-comment">------------------------------------------------------</span>
<span class="org-comment-delimiter">--</span>
<span class="org-comment-delimiter">-- </span><span class="org-comment">foldMap :: (a -&gt; Endo a) -&gt; [Endo a] -&gt; Endo a</span>
<span class="org-comment-delimiter">--</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>t foldMap 
<span class="org-function-name">foldMap</span> <span class="org-haskell-operator">::</span> (<span class="org-haskell-type">Monoid</span> m, <span class="org-haskell-type">Foldable</span> t) <span class="org-haskell-operator">=&gt;</span> (a <span class="org-haskell-operator">-&gt;</span> m) <span class="org-haskell-operator">-&gt;</span> t a <span class="org-haskell-operator">-&gt;</span> m
<span class="org-haskell-operator">&gt;</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">let</span> f <span class="org-haskell-operator">=</span> foldMap <span class="org-haskell-constructor">Endo</span> [ (<span class="org-haskell-operator">+</span>10),  (<span class="org-haskell-operator">*</span>3),  <span class="org-haskell-operator">\</span>x <span class="org-haskell-operator">-&gt;</span> 10 <span class="org-haskell-operator">*</span> x <span class="org-haskell-operator">-</span> 5] 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>t f
<span class="org-function-name">f</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Num</span> a <span class="org-haskell-operator">=&gt;</span> <span class="org-haskell-type">Endo</span> a
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">appEndo</span> f 4
115
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">appEndo</span> f 5
145
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">let</span> f2 <span class="org-haskell-operator">=</span> foldMap (<span class="org-haskell-operator">\</span>f <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-constructor">Endo</span> <span class="org-haskell-operator">$</span> <span class="org-haskell-operator">\</span>x <span class="org-haskell-operator">-&gt;</span> f (3 <span class="org-haskell-operator">*</span> x <span class="org-haskell-operator">-</span> 2))  [ (<span class="org-haskell-operator">+</span>10),  (<span class="org-haskell-operator">*</span>3),  <span class="org-haskell-operator">\</span>x <span class="org-haskell-operator">-&gt;</span> 10 <span class="org-haskell-operator">*</span> x <span class="org-haskell-operator">-</span> 5] 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">appEndo</span> f2 4
2555
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">appEndo</span> f2 5
3365

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">let</span> f3 <span class="org-haskell-operator">=</span> fold <span class="org-haskell-operator">$</span> map  (<span class="org-haskell-operator">\</span>f <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-constructor">Endo</span> <span class="org-haskell-operator">$</span> <span class="org-haskell-operator">\</span>x <span class="org-haskell-operator">-&gt;</span> f (3 <span class="org-haskell-operator">*</span> x <span class="org-haskell-operator">-</span> 2))  [ (<span class="org-haskell-operator">+</span>10),  (<span class="org-haskell-operator">*</span>3),  <span class="org-haskell-operator">\</span>x <span class="org-haskell-operator">-&gt;</span> 10 <span class="org-haskell-operator">*</span> x <span class="org-haskell-operator">-</span> 5] 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>t f3
<span class="org-function-name">f3</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Num</span> a <span class="org-haskell-operator">=&gt;</span> <span class="org-haskell-type">Endo</span> a
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">appEndo</span> f3 4
2555
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">appEndo</span> f3 5
3365
<span class="org-haskell-operator">&gt;</span>
</pre>
</div>
</div>
</div>
