haskell/monoids.org
**** Maybe 

#+BEGIN_SRC haskell 
instance Foldable Maybe where
    foldMap _ Nothing  = mempty
    foldMap f (Just x) = f x
#+END_SRC

Example 1: Maybe foldable and list monoid 

#+BEGIN_SRC haskell 
  > import Data.Monoid
  > import Data.Foldable 
  > 

  -- List Monoid
  --
  > mempty :: [Int]
  []
  > [1, 2, 3] <> [3, 5] <> [9, 10]
  [1,2,3,3,5,9,10]
  > 


  --
  -- fold :: Maybe [Int] -> [Int]
  --
  > :t fold
  fold :: (Monoid m, Foldable t) => t m -> m
  >

  > fold (Just [1, 2, 3, 4])
  [1,2,3,4]
  >
  > fold Nothing :: [Int]
  []
  >


  -- foldMap :: (a -> [a]) -> Maybe [a] -> [a] 
  --
  > :t foldMap 
  foldMap :: (Monoid m, Foldable t) => (a -> m) -> t a -> m
  >

  > foldMap (\x -> [2 * x, 3 + x]) (Just 10)
  [20,13]
  > foldMap (\x -> [2 * x, 3 + x, x + 8]) (Just 10)
  [20,13,18]
  > foldMap (\x -> [2 * x, 3 + x, x + 8]) (Just 5)
  [10,8,13]
  > foldMap (\x -> [2 * x, 3 + x, x + 8]) Nothing
  []
  >


  > :t foldl
  foldl :: Foldable t => (b -> a -> b) -> b -> t a -> b
  > 
  > foldl (\ acc x -> 10 * acc + x) 10 (Just 4)
  104
  > foldl (\ acc x -> 10 * acc + x) 10 Nothing
  10
  > 

  > 
  > foldr (\x acc -> 10 * acc + x) 10 (Just 5)
  105
  > foldr (\x acc -> 10 * acc + x) 10 Nothing
  10
  > 

#+END_SRC

Example: Maybe foldable and Sum monoid 

#+BEGIN_SRC haskell 
  import Data.Foldable
  import Data.Monoid     

  > fold (Just $ Sum 10)
  Sum {getSum = 10}

  > fold (Just $ Sum 10) :: Sum Int
  Sum {getSum = 10}
  > 

  > fold Nothing :: Sum Int
  Sum {getSum = 0}
  >

  > 
  > foldMap (\x -> Sum $ x * 3) (Just 10)
  Sum {getSum = 30}
  > foldMap (\x -> Sum $ x * 3) Nothing
  Sum {getSum = 0}
  > 


#+END_SRC

*** References 

References: 

 - [[https://en.wikibooks.org/wiki/Haskell/Foldable][Haskell/Foldable - Wikibooks, open books for an open world]]


 - Module [[https://hackage.haskell.org/package/base-4.9.1.0/docs/Data-Foldable.html][Data.Foldable]]

  
 - Module Source Code: [[https://hackage.haskell.org/package/base-4.9.1.0/docs/src/Data.Foldable.html][Data.Foldable]]


See also: 


 - [[http://brianshourd.com/posts/2013-01-15-tilt-foldable.html][Brian Shourd - Blog - Thing I Learned Today: Foldable]]  


 - [[https://byorgey.wordpress.com/2012/11/05/foldr-is-made-of-monoids/][foldr is made of monoids ]]


 - [[https://ocharles.org.uk/blog/posts/2013-02-12-quick-dsls-with-endo-writers.html][Quick and Easy DSLs with Writer Endo]]


