haskell/monoids.html

<div id="outline-container-sec-1-2-2-3" class="outline-5">
<h5 id="sec-1-2-2-3"><span class="section-number-5">1.2.2.3</span> Maybe</h5>
<div class="outline-text-5" id="text-1-2-2-3">
<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-keyword">instance</span> <span class="org-haskell-type">Foldable</span> <span class="org-haskell-type">Maybe</span> <span class="org-haskell-keyword">where</span>
    foldMap <span class="org-haskell-keyword">_</span> <span class="org-haskell-constructor">Nothing</span>  <span class="org-haskell-operator">=</span> mempty
    foldMap f (<span class="org-haskell-constructor">Just</span> x) <span class="org-haskell-operator">=</span> f x
</pre>
</div>

<p>
Example 1: Maybe foldable and list monoid 
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">Data.Monoid</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">Data.Foldable</span> 
<span class="org-haskell-operator">&gt;</span> 

<span class="org-comment-delimiter">-- </span><span class="org-comment">List Monoid</span>
<span class="org-comment-delimiter">--</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">mempty</span> <span class="org-haskell-operator">::</span> [<span class="org-haskell-type">Int</span>]
<span class="org-haskell-constructor">[]</span>
<span class="org-haskell-operator">&gt;</span> [1, 2, 3] <span class="org-haskell-operator">&lt;&gt;</span> [3, 5] <span class="org-haskell-operator">&lt;&gt;</span> [9, 10]
[1,2,3,3,5,9,10]
<span class="org-haskell-operator">&gt;</span> 


<span class="org-comment-delimiter">--</span>
<span class="org-comment-delimiter">-- </span><span class="org-comment">fold :: Maybe [Int] -&gt; [Int]</span>
<span class="org-comment-delimiter">--</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>t fold
<span class="org-function-name">fold</span> <span class="org-haskell-operator">::</span> (<span class="org-haskell-type">Monoid</span> m, <span class="org-haskell-type">Foldable</span> t) <span class="org-haskell-operator">=&gt;</span> t m <span class="org-haskell-operator">-&gt;</span> m
<span class="org-haskell-operator">&gt;</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">fold</span> (<span class="org-haskell-type">Just</span> [1, 2, 3, 4])
[1,2,3,4]
<span class="org-haskell-operator">&gt;</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">fold</span> <span class="org-haskell-constructor">Nothing</span> <span class="org-haskell-operator">::</span> [<span class="org-haskell-type">Int</span>]
<span class="org-haskell-constructor">[]</span>
<span class="org-haskell-operator">&gt;</span>


<span class="org-comment-delimiter">-- </span><span class="org-comment">foldMap :: (a -&gt; [a]) -&gt; Maybe [a] -&gt; [a] </span>
<span class="org-comment-delimiter">--</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>t foldMap 
<span class="org-function-name">foldMap</span> <span class="org-haskell-operator">::</span> (<span class="org-haskell-type">Monoid</span> m, <span class="org-haskell-type">Foldable</span> t) <span class="org-haskell-operator">=&gt;</span> (a <span class="org-haskell-operator">-&gt;</span> m) <span class="org-haskell-operator">-&gt;</span> t a <span class="org-haskell-operator">-&gt;</span> m
<span class="org-haskell-operator">&gt;</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">foldMap</span> (<span class="org-haskell-operator">\</span>x <span class="org-haskell-operator">-&gt;</span> [2 <span class="org-haskell-operator">*</span> x, 3 <span class="org-haskell-operator">+</span> x]) (<span class="org-haskell-type">Just</span> 10)
[20,13]
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">foldMap</span> (<span class="org-haskell-operator">\</span>x <span class="org-haskell-operator">-&gt;</span> [2 <span class="org-haskell-operator">*</span> x, 3 <span class="org-haskell-operator">+</span> x, x <span class="org-haskell-operator">+</span> 8]) (<span class="org-haskell-constructor">Just</span> 10)
[20,13,18]
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">foldMap</span> (<span class="org-haskell-operator">\</span>x <span class="org-haskell-operator">-&gt;</span> [2 <span class="org-haskell-operator">*</span> x, 3 <span class="org-haskell-operator">+</span> x, x <span class="org-haskell-operator">+</span> 8]) (<span class="org-haskell-constructor">Just</span> 5)
[10,8,13]
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">foldMap</span> (<span class="org-haskell-operator">\</span>x <span class="org-haskell-operator">-&gt;</span> [2 <span class="org-haskell-operator">*</span> x, 3 <span class="org-haskell-operator">+</span> x, x <span class="org-haskell-operator">+</span> 8]) <span class="org-haskell-constructor">Nothing</span>
<span class="org-haskell-constructor">[]</span>
<span class="org-haskell-operator">&gt;</span>


<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>t foldl
<span class="org-function-name">foldl</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Foldable</span> t <span class="org-haskell-operator">=&gt;</span> (b <span class="org-haskell-operator">-&gt;</span> a <span class="org-haskell-operator">-&gt;</span> b) <span class="org-haskell-operator">-&gt;</span> b <span class="org-haskell-operator">-&gt;</span> t a <span class="org-haskell-operator">-&gt;</span> b
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">foldl</span> (<span class="org-haskell-operator">\</span> acc x <span class="org-haskell-operator">-&gt;</span> 10 <span class="org-haskell-operator">*</span> acc <span class="org-haskell-operator">+</span> x) 10 (<span class="org-haskell-type">Just</span> 4)
104
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">foldl</span> (<span class="org-haskell-operator">\</span> acc x <span class="org-haskell-operator">-&gt;</span> 10 <span class="org-haskell-operator">*</span> acc <span class="org-haskell-operator">+</span> x) 10 <span class="org-haskell-constructor">Nothing</span>
10
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">foldr</span> (<span class="org-haskell-operator">\</span>x acc <span class="org-haskell-operator">-&gt;</span> 10 <span class="org-haskell-operator">*</span> acc <span class="org-haskell-operator">+</span> x) 10 (<span class="org-haskell-constructor">Just</span> 5)
105
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">foldr</span> (<span class="org-haskell-operator">\</span>x acc <span class="org-haskell-operator">-&gt;</span> 10 <span class="org-haskell-operator">*</span> acc <span class="org-haskell-operator">+</span> x) 10 <span class="org-haskell-constructor">Nothing</span>
10
<span class="org-haskell-operator">&gt;</span>
</pre>
</div>

<p>
Example: Maybe foldable and Sum monoid 
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">Data.Foldable</span>
<span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">Data.Monoid</span>     

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">fold</span> (<span class="org-haskell-constructor">Just</span> <span class="org-haskell-operator">$</span> <span class="org-haskell-constructor">Sum</span> 10)
<span class="org-haskell-constructor">Sum</span> {getSum <span class="org-haskell-operator">=</span> 10}

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">fold</span> (<span class="org-haskell-constructor">Just</span> <span class="org-haskell-operator">$</span> <span class="org-haskell-constructor">Sum</span> 10) <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Sum</span> <span class="org-haskell-type">Int</span>
<span class="org-haskell-constructor">Sum</span> {getSum <span class="org-haskell-operator">=</span> 10}
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">fold</span> <span class="org-haskell-constructor">Nothing</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Sum</span> <span class="org-haskell-type">Int</span>
<span class="org-haskell-constructor">Sum</span> {getSum <span class="org-haskell-operator">=</span> 0}
<span class="org-haskell-operator">&gt;</span>

<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">foldMap</span> (<span class="org-haskell-operator">\</span>x <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-constructor">Sum</span> <span class="org-haskell-operator">$</span> x <span class="org-haskell-operator">*</span> 3) (<span class="org-haskell-constructor">Just</span> 10)
<span class="org-haskell-constructor">Sum</span> {getSum <span class="org-haskell-operator">=</span> 30}
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">foldMap</span> (<span class="org-haskell-operator">\</span>x <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-constructor">Sum</span> <span class="org-haskell-operator">$</span> x <span class="org-haskell-operator">*</span> 3) <span class="org-haskell-constructor">Nothing</span>
<span class="org-haskell-constructor">Sum</span> {getSum <span class="org-haskell-operator">=</span> 0}
<span class="org-haskell-operator">&gt;</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-1-2-3" class="outline-4">
<h4 id="sec-1-2-3"><span class="section-number-4">1.2.3</span> References</h4>
<div class="outline-text-4" id="text-1-2-3">
<p>
References: 
</p>

<ul class="org-ul">
<li><a href="https://en.wikibooks.org/wiki/Haskell/Foldable">Haskell/Foldable - Wikibooks, open books for an open world</a>
</li>
</ul>


<ul class="org-ul">
<li>Module <a href="https://hackage.haskell.org/package/base-4.9.1.0/docs/Data-Foldable.html">Data.Foldable</a>
</li>
</ul>


<ul class="org-ul">
<li>Module Source Code: <a href="https://hackage.haskell.org/package/base-4.9.1.0/docs/src/Data.Foldable.html">Data.Foldable</a>
</li>
</ul>


<p>
See also: 
</p>


<ul class="org-ul">
<li><a href="http://brianshourd.com/posts/2013-01-15-tilt-foldable.html">Brian Shourd - Blog - Thing I Learned Today: Foldable</a>  
</li>
</ul>


<ul class="org-ul">
<li><a href="https://byorgey.wordpress.com/2012/11/05/foldr-is-made-of-monoids/">foldr is made of monoids </a>
</li>
</ul>


<ul class="org-ul">
<li><a href="https://ocharles.org.uk/blog/posts/2013-02-12-quick-dsls-with-endo-writers.html">Quick and Easy DSLs with Writer Endo</a>
</li>
</ul>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: nobody</p>
<p class="date">Created: 2018-05-07 Mon 10:11</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
